Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
// 1=wlaczone, 0=wylaczone (#if usuwa kod z kompilacji -> zero narzutu gdy off).
#define ENABLE_WATCHDOG            1   // sprzetowy reset po zawieszeniu petli (TWDT)
#define ENABLE_LOW_BATTERY_PROTECT 1   // ochrona ogniwa: degradacja + ochronny sen
#define ENABLE_DIAGNOSTICS         1   // strona /info + liczniki resetow
#define ENABLE_RTC_AUTOTRIM        1   // automatyczna kalibracja offsetu RTC z pomiaru NTP

// Szybki powrot do AP po znanym kanale+BSSID (krocej z wlaczonym radiem).
#define FAST_NTP_RECONNECT         1

// UWAGA (decyzja sprzetowa, NIE wlaczac ponownie): odciecie VDDSDIO w light-sleep
// (dawna flaga POWER_DOWN_FLASH_IN_SLEEP) jest NIEKOMPATYBILNE z ta plytka
// (flash/PSRAM na tej szynie -> reboot, cichy budzik). Kod usuniety celowo.

// ============================================================================
//  [3] KONFIGURACJA
//  Wszystkie stale projektu w nazwanych przestrzeniach constexpr. Zmiana tutaj
//  nie wymaga szukania magicznych liczb po pliku.
// ============================================================================

// --- Piny (Waveshare ESP32-S3-RLCD-4.2) ---------------------------------------
namespace pins {
  // Wyswietlacz RLCD (HARDWARE SPI; SPI.begin w DisplayUi::setup).
  constexpr gpio_num_t LCD_SCK    = GPIO_NUM_11;
  constexpr gpio_num_t LCD_MOSI   = GPIO_NUM_12;
  constexpr gpio_num_t LCD_DC     = GPIO_NUM_5;
  constexpr gpio_num_t LCD_CS     = GPIO_NUM_40;
  constexpr gpio_num_t LCD_RST    = GPIO_NUM_41;
  // I2C (kodek ES8311 + RTC PCF85063A na wspolnej szynie).
  constexpr gpio_num_t I2C_SDA    = GPIO_NUM_13;
  constexpr gpio_num_t I2C_SCL    = GPIO_NUM_14;
  constexpr gpio_num_t RTC_INT    = GPIO_NUM_15;  // wyjscie INT alarmu PCF85063A (aktywne LOW)
  // Audio I2S do ES8311 + wlacznik wzmacniacza.
  constexpr gpio_num_t I2S_MCLK   = GPIO_NUM_16;
  constexpr gpio_num_t I2S_BCLK   = GPIO_NUM_9;
  constexpr gpio_num_t I2S_WS     = GPIO_NUM_45;
  constexpr gpio_num_t I2S_DOUT   = GPIO_NUM_8;
  constexpr gpio_num_t PA_ENABLE  = GPIO_NUM_46;
  // Przyciski (aktywne LOW, wybudzanie EXT1).
  constexpr gpio_num_t KEY        = GPIO_NUM_18;  // krotko: wycisz budzik / panel WWW; dlugo: nic
  constexpr gpio_num_t PREVIEW    = GPIO_NUM_0;   // BOOT; krotko: podglad najblizszego budzika

  // Piny trzymane (gpio_hold) przez deep-sleep, by panel nie dostawal smieci.
  constexpr std::array<gpio_num_t, 5> DEEP_SLEEP_HOLD = {
    LCD_DC, LCD_CS, LCD_SCK, LCD_MOSI, LCD_RST
  };
}

// --- Wyswietlacz --------------------------------------------------------------
namespace lcd {
  constexpr int      WIDTH        = 400;
  constexpr int      HEIGHT       = 300;
  constexpr uint32_t SPI_BUS_HZ   = 2000000UL;   // zalecenie sterownika U8g2 dla ST7305
  constexpr uint8_t  CONTRAST     = 255;
}

// --- Szyna I2C ----------------------------------------------------------------
namespace i2cbus {
  constexpr uint32_t FREQ_HZ                = 400000;
  constexpr uint8_t  RECOVER_MAX_PULSES     = 9;    // maks. bitow trzymanych przez slave (spec I2C)
  constexpr uint32_t RECOVER_HALF_PERIOD_US = 50;   // pol okresu ~10 kHz przy recznym taktowaniu
}

// --- RTC PCF85063A: adres, rejestry, bity (datasheet NXP rev.7) -----------------
namespace pcf85063 {
  constexpr uint8_t I2C_ADDR         = 0x51;

  constexpr uint8_t REG_CONTROL1     = 0x00;
  constexpr uint8_t REG_CONTROL2     = 0x01;
  constexpr uint8_t REG_OFFSET       = 0x02;
  constexpr uint8_t REG_RAM_BYTE     = 0x03;   // wolny bajt RAM -> marker formatu czasu
  constexpr uint8_t REG_SECONDS      = 0x04;   // 0x04..0x0A: sec,min,hour,day,wday,month,year
  constexpr uint8_t REG_SECOND_ALARM = 0x0B;   // 0x0B..0x0F: sec,min,hour,day,wday alarm
  constexpr uint8_t REG_TIMER_VALUE  = 0x10;
  constexpr uint8_t REG_TIMER_MODE   = 0x11;

  constexpr uint8_t CTRL1_EXT_TEST   = 1u << 7;
  constexpr uint8_t CTRL1_STOP       = 1u << 5;  // zatrzymuje licznik + zeruje preskaler
  constexpr uint8_t CTRL1_CIE        = 1u << 2;  // przerwanie korekcji
  constexpr uint8_t CTRL1_12H        = 1u << 1;  // tryb 12h (uzywamy 24h)
  constexpr uint8_t CTRL2_AIE        = 1u << 7;  // przerwanie alarmu na pin INT
  constexpr uint8_t CTRL2_COF_OFF    = 0x07;     // CLKOUT wylaczony (mniejszy pobor)
  constexpr uint8_t SECONDS_OS       = 1u << 7;  // oscylator sie zatrzymal -> czas niewiarygodny
  constexpr uint8_t ALARM_AEN_OFF    = 0x80;     // AEN=1 w rejestrze alarmu = pole wylaczone
  constexpr uint8_t TIMER_MODE_OFF   = 0x18;     // TCF=1/60 Hz, TE=0, TIE=0 (timer nieuzywany)

  // Czas z zatrzymanego/testowego/12h RTC nie jest aktualny -> odrzucamy odczyt.
  constexpr uint8_t CTRL1_INVALID_MODE_MASK = CTRL1_EXT_TEST | CTRL1_STOP | CTRL1_12H;
  // prepareTimeWrite zeruje takze CIE (INT wylacznie dla alarmu wybudzajacego).
  constexpr uint8_t CTRL1_RUN_CLEAR_MASK    = CTRL1_EXT_TEST | CTRL1_STOP | CTRL1_CIE | CTRL1_12H;

  constexpr uint8_t FORMAT_MARKER    = 0xA5;     // w REG_RAM_BYTE: "czas zapisal ten firmware"
}

// --- Kalibracja dryftu krysztalu RTC (rejestr Offset 0x02 PCF85063A) -----------
//   offset DODATNI spowalnia zegar; UJEMNY przyspiesza. Offset[LSB]=blad_ppm/4.34.
//   Zmierzony surowy dryft -2 s/24h -> -5 LSB = -21.7 ppm. 0x7B = -5 LSB, MODE=0.
//   FACTORY_OFFSET_REG to wartosc STARTOWA; z ENABLE_RTC_AUTOTRIM biezacy offset
//   zyje w NVS ("rtcOffLsb") i jest korygowany automatycznie z pomiarow NTP.
namespace rtccfg {
  constexpr uint8_t  FACTORY_OFFSET_REG   = 0x7B;    // -5 LSB, MODE=0 (-21.7 ppm; przyspiesza)
  constexpr float    OFFSET_LSB_PPM_MODE0 = 4.34f;
  constexpr float    OFFSET_LSB_PPM_MODE1 = 4.069f;
  constexpr uint8_t  OFFSET_WRITE_RETRIES = 4;
  constexpr float    PPM_SEC_PER_DAY      = 0.0864f; // 1 ppm = 0.0864 s/dobe

  constexpr uint32_t WRITE_RETRY_MS       = 5000;    // ponowienie zapisu czasu po NTP
  constexpr uint8_t  WRITE_RETRIES        = 12;
  constexpr int      WRITE_VERIFY_TOLERANCE_SEC = 2; // odczyt zwrotny po zapisie czasu
  constexpr int64_t  ALIGN_ABORT_US       = 1500000; // wyrownanie fazy startuje z <=1 s;
                                                     // wiecej = rownolegly skok czasu -> przerwij zapis
  constexpr int      WAKE_MAX_SKEW_SEC    = 30;      // rozjazd RTC/system dyskwalifikuje alarm

