Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
#if ENABLE_RTC_AUTOTRIM
  // Pomiar fazowy (granica sekundy RTC vs czas NTP) ma rozdzielczosc ~ms, wiec juz
  // jedno okno 6 h daje ppm z niepewnoscia ~0.1 ppm — wystarcza do korekty o 1 LSB
  // (4.34 ppm). Kwantyzacja rejestru ogranicza dryf resztkowy do ~±2.2 ppm,
  // czyli ~±0.19 s/dobe — ponizej celu 1 s/dobe.
  constexpr int64_t  AUTOTRIM_MIN_WINDOW_SEC     = 6 * 3600;   // min. okno NTP->NTP
  constexpr int64_t  AUTOTRIM_MAX_WINDOW_SEC     = 7 * 86400;  // dluzsze = watpliwa kotwica
  constexpr float    AUTOTRIM_MAX_PLAUSIBLE_PPM  = 150.0f;     // wiecej = zly pomiar, nie kalibruj
  constexpr uint32_t BOUNDARY_POLL_TIMEOUT_MS    = 1300;       // >1 s: przewrot MUSI nadejsc
#endif
}

// --- Kodek audio ES8311 --------------------------------------------------------
namespace es8311 {
  constexpr uint8_t I2C_ADDR       = 0x18;
  constexpr uint8_t REG_RESET      = 0x00;  // reset / power-up sekwencja
  constexpr uint8_t REG_CLK_MGR1   = 0x01;
  constexpr uint8_t REG_SDP_IN     = 0x09;  // format danych I2S (DAC)
  constexpr uint8_t REG_SDP_OUT    = 0x0A;  // format danych I2S (ADC)
  constexpr uint8_t REG_DAC_VOLUME = 0x32;
  constexpr uint8_t DAC_VOLUME_MAX = 215;   // 0xD7 ~ +12 dB; mniejsze ryzyko przesteru niz 0xFF
}

// --- Akumulator (Samsung INR18650-35E) ------------------------------------------
#ifndef BATTERY_CAPACITY_MAH
#define BATTERY_CAPACITY_MAH 3400          // nadpisywalne z linii kompilacji (-D)
#endif
namespace batcfg {
  constexpr uint32_t     CAPACITY_MAH        = BATTERY_CAPACITY_MAH;
  constexpr adc_channel_t ADC_CHANNEL        = ADC_CHANNEL_3;   // = GPIO4 na ESP32-S3
  constexpr float        DIVIDER_RATIO       = 3.0f;
  constexpr float        VOLTAGE_CALIBRATION = 1.017f;
  constexpr uint8_t      SAMPLE_COUNT        = 16;
  constexpr float        EMA_KEEP            = 0.80f; // filtr napiecia: 80% starej + 20% nowej probki
  constexpr int          ADC_FALLBACK_FULL_MV = 3300; // przelicznik bez kalibracji eFuse
  constexpr int          ADC_MAX_RAW          = 4095;
  constexpr uint8_t      FULL_FLOOR          = 99;   // >=99% pokazuj 100%
  constexpr uint8_t      FULL_HOLD_FLOOR     = 98;   // trzymaj 100% az spadnie < 98%
  constexpr uint32_t     READ_INTERVAL_MS    = 10UL * 60UL * 1000UL;
  constexpr uint32_t     BUSY_RETRY_MS       = 30UL * 1000UL;

  // Ochrona niskiego stanu ogniwa (dwustopniowa).
  constexpr uint8_t      LOW_PERCENT          = 15;     // stopien 1: bez auto-NTP
  constexpr float        CRITICAL_VOLTAGE     = 3.05f;  // stopien 2: ochronny deep-sleep
  constexpr uint8_t      CRITICAL_PERCENT     = 3;
  constexpr uint32_t     CRITICAL_RECHECK_SEC = 30UL * 60UL;

  // Estymator zuzycia (czysta arytmetyka na probkach SoC).
  constexpr uint8_t      DRAIN_CHARGE_HYST     = 5;      // wzrost SoC% = "doladowano" -> reset kotwicy
  constexpr int64_t      DRAIN_MIN_WINDOW_SEC  = 43200;  // min. 12 h danych (plaskie plateau = szum ADC)
  constexpr int          DRAIN_MIN_DSOC        = 2;      // min. spadek SoC%, by estymata miala sens

  // Krzywa OCV->SoC dla INR18650-35E (Li-ion NMC), 3.00 V=0%, 4.20 V=100%.
  struct OcvPoint { float voltage; uint8_t soc; };
  constexpr std::array<OcvPoint, 24> OCV_CURVE = {{
    { 3.00f,   0 }, { 3.10f,   2 }, { 3.20f,   4 }, { 3.30f,   7 },
    { 3.40f,  11 }, { 3.45f,  14 }, { 3.50f,  18 }, { 3.55f,  23 },
    { 3.60f,  29 }, { 3.65f,  36 }, { 3.70f,  43 }, { 3.73f,  47 },
    { 3.76f,  51 }, { 3.79f,  55 }, { 3.82f,  59 }, { 3.85f,  63 },
    { 3.88f,  68 }, { 3.91f,  71 }, { 3.95f,  76 }, { 4.00f,  80 },
    { 4.05f,  87 }, { 4.10f,  93 }, { 4.15f,  97 }, { 4.20f, 100 },
  }};
}

// --- Budziki i audio ------------------------------------------------------------
namespace alarmcfg {
  constexpr int      ALARM_COUNT          = 3;
  constexpr int      SOUND_COUNT          = 3;
  constexpr int      MAX_VOLUME           = 21;    // natywny zakres audioI2S setVolume
  constexpr uint8_t  DEFAULT_VOLUME       = 10;
  constexpr uint8_t  CODEC_VOLUME_PERCENT = 100;
  constexpr uint32_t LATE_WINDOW_SEC      = 20;    // ile po terminie budzik jeszcze "wchodzi"
  constexpr uint32_t RING_RETRY_MS        = 3000;
  constexpr uint32_t RING_MIN_PLAY_MS     = 750;   // krocej = uszkodzony MP3 (patrz serviceAudio)
  constexpr uint8_t  RING_MAX_ERRORS      = 10;
  constexpr uint32_t RING_TIMEOUT_MS      = 15UL * 60UL * 1000UL;
  constexpr uint32_t LOOP_GAP_MARGIN_SEC  = 2;     // zapas okna spoznienia ponad przestoj petli

  constexpr std::array<const char *, SOUND_COUNT> SOUND_FILES = {
    "/alarm1.mp3", "/alarm2.mp3", "/alarm3.mp3"
  };
  constexpr std::array<const char *, SOUND_COUNT> SOUND_NAMES = {
    "Dzwiek 1", "Dzwiek 2", "Dzwiek 3"
  };
}

// --- WiFi / NTP -----------------------------------------------------------------
namespace ntpcfg {
  constexpr uint32_t WIFI_TIMEOUT_MS       = 15000;
  constexpr uint32_t PACKET_TIMEOUT_MS     = 50000;  // lwIP SNTP: 3 serwery co ~15 s -> 50 s pokrywa
  constexpr uint32_t WIFI_LOST_GRACE_MS    = 8000;   // zerwane WiFi w trakcie proby: tyle na powrot
  constexpr uint32_t WIFI_HINT_FALLBACK_MS = 5000;   // po tylu ms hint kanal+BSSID -> pelny skan
  constexpr uint32_t ALARM_CATCHUP_SEC     = 90;     // poszerzone okno budzika tuz po korekcie czasu

  constexpr uint32_t QUICK_RETRY_MS        = 30000;      // seria szybka po starcie
  constexpr uint32_t BACKOFF_MIN_MS        = 60000;      // 1 min
  constexpr uint32_t BACKOFF_MAX_MS        = 3600000;    // 1 h

  constexpr int      DAILY_SYNC_HOUR       = 18;  // codzienna synchronizacja 18:00-18:05 (+ dogonienie do 23:00)
  constexpr int      SYNC_MINUTE_WINDOW    = 5;

  constexpr const char *TZ_POLAND    = "CET-1CEST,M3.5.0/2,M10.5.0/3";
  constexpr const char *SERVER_1     = "pool.ntp.org";
  constexpr const char *SERVER_2     = "time.google.com";
  constexpr const char *SERVER_3     = "time.cloudflare.com";
  constexpr const char *DEFAULT_SSID = "";
  constexpr const char *DEFAULT_PASS = "";
}

// --- Energia: CPU, sen dzienny i nocny -------------------------------------------
// CPU: w dzien 80 MHz wystarcza (render RLCD ograniczony SPI 2 MHz, a SPI/I2C/WiFi
// taktowane z APB, ktore przy >=80 MHz CPU i tak chodzi 80 MHz). 160 MHz tylko na
// czas dekodowania MP3 (AudioPlayer podbija/odpuszcza).
namespace powercfg {
  constexpr uint32_t DAY_CPU_MHZ                  = 80;
  constexpr uint32_t AUDIO_CPU_MHZ                = 160;
  constexpr uint32_t PRE_SLEEP_CPU_MHZ            = 40;    // tuz przed deep-sleep

  constexpr uint64_t IDLE_LIGHT_SLEEP_US          = 900000ULL;  // fallback gdy czas nieznany
  constexpr uint64_t IDLE_LIGHT_SLEEP_MAX_SEC     = 60ULL;      // sen do granicy minuty -> 1 wybudzenie/min
  constexpr int      NIGHT_START_HOUR             = 23;
  constexpr int      NIGHT_START_MIN              = 59;
  constexpr int      NIGHT_END_HOUR               = 6;
  constexpr int      NIGHT_END_MIN                = 0;
  constexpr uint32_t NIGHT_MIN_SLEEP_SEC          = 5;
  constexpr uint32_t NIGHT_FALLBACK_CHUNK_SEC     = 3600;  // maks. odcinek snu bez alarmu RTC
  constexpr uint32_t NIGHT_FALLBACK_ALARM_CHUNK_SEC = 300; // jw. gdy najblizszy jest budzik: krocej
  constexpr uint32_t NIGHT_EMERGENCY_SLEEP_SEC    = 6UL * 3600UL; // cel snu gdy liczenie zawiodlo
  constexpr uint32_t DISPLAY_FLUSH_MS             = 150;   // panel konczy odswiezanie przed snem
}

