Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
// --- Przyciski --------------------------------------------------------------------
namespace btncfg {
  constexpr uint32_t DEBOUNCE_MS            = 40;
  constexpr uint32_t KEY_LONG_PRESS_MS      = 1500;  // KEY >= tyle = "dlugie": zadnej akcji,
                                                     // tylko tlumi akcje krotka przy zwolnieniu
  constexpr uint32_t BOOT_SHORT_PRESS_MAX_MS = 1200; // PREVIEW/BOOT <= tyle -> podglad budzika
  constexpr uint32_t PREVIEW_SHOW_MS        = 5000;
  constexpr uint32_t WAKE_HOLD_MS           = 15000; // po wybudzeniu przyciskiem: pokaz tresc 15 s
}

// --- Panel WWW ----------------------------------------------------------------------
namespace webcfg {
  constexpr uint32_t WINDOW_MS         = 5UL * 60UL * 1000UL;  // okno aktywnosci panelu
  constexpr uint32_t WIFI_GRACE_MS     = 10000;                // zanik WiFi: tyle na auto-reconnect
  constexpr uint16_t HTTP_PORT         = 80;
  constexpr size_t   HTML_ROOT_RESERVE = 14000;  // typowy rozmiar strony glownej (bez realokacji)
  constexpr size_t   HTML_INFO_RESERVE = 4500;
}

// --- System plikow MP3 ----------------------------------------------------------------
namespace fscfg {
  constexpr uint8_t RECOVER_MAX_PASSES = 16;  // limit przebiegow naprawy .bak/.part
  constexpr size_t  MP3_NAME_MIN       = 5;   // "x.mp3"
  constexpr size_t  MP3_NAME_MAX       = 25;  // SPIFFS: pelna sciezka <= 31 znakow
}

// --- Klucze NVS (Preferences) ---------------------------------------------------------
// KOMPATYBILNOSC: nazwy identyczne z v7.x — istniejace urzadzenie zachowa budziki,
// WiFi i wykalibrowany offset RTC po wgraniu v8.0.
namespace nvskeys {
  constexpr const char *NAMESPACE_NAME = "zegar7";
  constexpr const char *ALARMS         = "alarms";
  constexpr const char *WIFI_SSID      = "ssid";
  constexpr const char *WIFI_PASS      = "pass";
  constexpr const char *RTC_OFFSET_LSB = "rtcOffLsb";
  constexpr const char *DRAIN_SOC      = "drnSoc";
  constexpr const char *DRAIN_MAH_DAY  = "drnMahDay";
  constexpr const char *DRAIN_DAY      = "drnDay";
  constexpr const char *RESETS_BROWNOUT = "rstBrown";
  constexpr const char *RESETS_WDT      = "rstWdt";
  constexpr const char *RESETS_PANIC    = "rstPanic";
}

// ============================================================================
//  [4] TYPY WSPOLNE — enum class i male struktury
// ============================================================================

// Maszyna stanow synchronizacji NTP (NetworkTimeService).
enum class NtpState : uint8_t { Idle, WifiConnecting, WaitingForPacket };

// Kto zazadal synchronizacji: harmonogram (auto) czy uzytkownik (przycisk /sync).
enum class SyncTrigger : uint8_t { Scheduled, Manual };

// Zdarzenia z debouncera przycisku (DebouncedButton::poll).
enum class ButtonEvent : uint8_t { None, Pressed, Released };

// Strony ekranu w kolejnosci PRIORYTETOW (dzwonienie > podglad > brak czasu > zegar).
enum class UiPage : uint8_t { Ringing, Preview, NoTime, Clock };

// Kto zatrzymal odtwarzanie: uzytkownik (kasuje tez dzwonienie) czy automat.
enum class StopCause : uint8_t { User, Auto };

// Ktory system plikow z MP3 zamontowano.
enum class FsBackend : uint8_t { None, Spiffs, LittleFs, FFatFs };

// Sklasyfikowana przyczyna startu/wybudzenia — liczona RAZ, pierwsza operacja
// setup() (flagi sa kombinowalne, dlatego POD z polami, nie pojedynczy enum).
struct WakeInfo {
  bool coldBoot;      // zasilanie/reset (nie deep-sleep)
  bool keyWake;       // KEY (zimny start liczy sie jak wybudzenie uzytkownika)
  bool previewWake;   // przycisk PREVIEW/BOOT
  bool rtcWake;       // pin INT alarmu PCF85063A
  bool timerWake;     // timer ESP (zabezpieczenie nocne)

  bool userWake() const      { return keyWake || previewWake; }
  bool scheduledWake() const { return rtcWake || timerWake; }

  static WakeInfo classify() {
    esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
    uint64_t ext1Pins = (cause == ESP_SLEEP_WAKEUP_EXT1) ? esp_sleep_get_ext1_wakeup_status() : 0;
    WakeInfo w;
    w.coldBoot    = (cause == ESP_SLEEP_WAKEUP_UNDEFINED);
    w.keyWake     = w.coldBoot || cause == ESP_SLEEP_WAKEUP_EXT0 ||
                    ((ext1Pins & (1ULL << pins::KEY)) != 0);
    w.previewWake = (ext1Pins & (1ULL << pins::PREVIEW)) != 0;
    w.rtcWake     = (ext1Pins & (1ULL << pins::RTC_INT)) != 0;
    w.timerWake   = (cause == ESP_SLEEP_WAKEUP_TIMER);
    return w;
  }
};

// Konfiguracja pojedynczego budzika. UWAGA: layout bajtowy identyczny z v7.x —
// blob NVS "alarms" (getBytes/putBytes) musi sie zgadzac po aktualizacji firmware.
struct AlarmConfig {
  uint8_t enabled;
  uint8_t hour;
  uint8_t minute;
  uint8_t second;
  uint8_t volume;     // 0..alarmcfg::MAX_VOLUME
  uint8_t sound;      // indeks 0..SOUND_COUNT-1 -> SOUND_FILES
  char    label[16];
};
// Kontrakt binarny bloba NVS: getBytes/putBytes przyjmuje dane tylko przy zgodnym
// rozmiarze — zmiana layoutu = cicha utrata budzikow uzytkownika po aktualizacji.
static_assert(sizeof(AlarmConfig) == 22, "layout NVS 'alarms' (v7.x) nie do ruszenia");
static_assert(std::is_trivially_copyable<AlarmConfig>::value, "NVS blob musi byc memcpy-owalny");

// Wynik wyszukiwania najblizszego budzika (zamiast 5 parametrow wyjsciowych).
struct NextAlarmInfo {
  int     index;      // -1 = brak wlaczonego budzika
  uint8_t hour, minute, second;
  char    label[sizeof(AlarmConfig::label)];
  bool    valid() const { return index >= 0; }
};

// ============================================================================
//  [5] CZAS — konwersje cywilne (czyste funkcje, bez stanu)
// ============================================================================
static int daysFromCivil(int y, unsigned m, unsigned d) {
  y -= m <= 2;
  const int era = (y >= 0 ? y : y - 399) / 400;
  const unsigned yoe = (unsigned)(y - era * 400);
  const unsigned doy = (153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1;
  const unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return era * 146097 + (int)doe - 719468;
}

static time_t utcEpochFromCivil(int y, int mo, int d, int h, int mi, int s) {
  return (time_t)daysFromCivil(y, (unsigned)mo, (unsigned)d) * 86400 + h * 3600 + mi * 60 + s;
}

