Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
  // mAh/dobe. <0 => za malo danych; 0 => brak mierzalnego zuzycia.
  float mahPerDay() const {
    if (!valid) return -1.0f;
    int64_t dt = lastEpoch - anchorEpoch;
    if (dt < batcfg::DRAIN_MIN_WINDOW_SEC) return -1.0f;
    int dSoc = (int)anchorSoc - (int)lastSoc;
    if (dSoc < batcfg::DRAIN_MIN_DSOC) return 0.0f;
    return (dSoc / 100.0f) * (float)batcfg::CAPACITY_MAH / (dt / 86400.0f);
  }

  // Dni do rozladowania przy biezacym tempie. <0 => nieznane.
  float daysRemaining(uint8_t curSoc) const {
    float perDay = mahPerDay();
    if (perDay <= 0.0f) return -1.0f;
    return (curSoc / 100.0f) * (float)batcfg::CAPACITY_MAH / perDay;
  }
};

// ============================================================================
//  [7] STAN PRZEZYWAJACY DEEP-SLEEP (RTC_DATA_ATTR)
//  POD: brak konstruktorow — wybudzenie z deep-sleep NIE rusza wartosci, a zimny
//  start zeruje pola JAWNIE w App::setup() (czesc wymaga sentineli -1, nie zera).
// ============================================================================
struct PersistentState {
  uint8_t        batteryPercent;
  float          batteryVoltage;
  bool           batteryHasReading;
  DrainEstimator drain;
  int            lastSummaryDay;
  uint8_t        wifiBssid[6];
  int32_t        wifiChannel;
  bool           wifiHint;
  uint16_t       bootCount;
  int64_t        coldBootEpoch;
  int32_t        lastRtcDriftSec;
  int64_t        lastNtpSyncEpoch;
  int64_t        prevNtpSyncEpoch;
  int            lastTriggerDay[alarmcfg::ALARM_COUNT];  // dedup wyzwolen budzikow
  int            ntpStartedDay;                          // dobowa synchronizacja 18:00
  int            ntpMorningDay;                          // poranne NTP po wybudzeniu 06:00
#if ENABLE_RTC_AUTOTRIM
  bool           rtcPhaseAligned;      // ostatni zapis RTC wyrownal faze -> okno mierzalne
  float          lastDriftPpm;         // ostatni pomiar fazowy (diagnostyka /info)
  int32_t        lastDriftWindowSec;   // dlugosc okna tego pomiaru
  uint16_t       autotrimAdjustCount;  // ile razy offset skorygowano automatycznie
#endif
};
// Nietrywialny typ dostalby konstruktor statyczny, ktory po KAZDYM wybudzeniu z
// deep-sleep wyzerowalby RTC RAM — te asercje pilnuja, by nikt tego nie zepsul.
static_assert(std::is_trivial<PersistentState>::value &&
              std::is_standard_layout<PersistentState>::value,
              "PersistentState musi byc trywialnym PODem (RTC_DATA_ATTR)");
static RTC_DATA_ATTR PersistentState g_persist;

// ============================================================================
//  [8] WATCHDOG ZADANIA (TWDT). Timeout > najdluzszy light-sleep dzienny (60 s).
//  Deep-sleep RESETUJE chip -> TWDT startuje od nowa w setup().
// ============================================================================
constexpr uint32_t WDT_TIMEOUT_S = 90;
constexpr uint32_t COLD_BOOT_SERIAL_DELAY_MS = 300;   // USB-CDC potrzebuje chwili po zimnym starcie

static inline void watchdogSetup() {
#if ENABLE_WATCHDOG
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t cfg = {};
    cfg.timeout_ms     = WDT_TIMEOUT_S * 1000U;
    cfg.idle_core_mask = 0;        // nie nadzoruj IDLE (sny sa celowe) — tylko loopTask
    cfg.trigger_panic  = true;     // timeout -> panic -> reset (odzysk bez nadzoru)
    if (esp_task_wdt_init(&cfg) == ESP_ERR_INVALID_STATE) {
      esp_task_wdt_reconfigure(&cfg);
    }
  #else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
  #endif
  esp_task_wdt_add(NULL);
  esp_task_wdt_reset();
#endif
}

static inline void watchdogFeed() {
#if ENABLE_WATCHDOG
  esp_task_wdt_reset();
#endif
}

// Detektor brownout sprzetowy (~2.51 V) CELOWO zostaje WLACZONY (chroni FLASH przy
// zalamaniu napiecia). Programowa ochrona ogniwa usypia juz przy ~3.05 V.

// ============================================================================
//  [9] SINGLETONY STEROWNIKOW SPRZETU
//  Konstruowane przy starcie statycznym; same nie dotykaja sprzetu az do begin().
//  Klasy logiki NIE siegaja po nie bezposrednio — dostaja referencje w
//  konstruktorach (lekki DI: latwa podmiana, widoczne zaleznosci, testowalnosc).
// ============================================================================
using RlcdDisplay = U8G2_ST7305_300X400_F_4W_HW_SPI;

// RST = U8X8_PIN_NONE: U8g2 nigdy sam nie pulsuje resetu — robimy to recznie w
// DisplayUi::setup() przy KAZDYM wejsciu w setup (zimny start ORAZ deep-sleep).
static RlcdDisplay display(U8G2_R1, pins::LCD_CS, pins::LCD_DC, U8X8_PIN_NONE);
static WebServer   httpServer(webcfg::HTTP_PORT);
static Preferences preferences;
static Audio       audioOutput;

// Gate atomic odrozniajacy realna odpowiedz serwera NTP od czasu wstepnie
// ustawionego z RTC. Callback SNTP musi byc wolna funkcja C.
static std::atomic<bool> g_ntpGotPacket{false};
static std::atomic<bool> g_ntpAcceptPacket{false};
static void onSntpSync(struct timeval *tv) {
  if (tv && g_ntpAcceptPacket.load(std::memory_order_acquire))
    g_ntpGotPacket.store(true, std::memory_order_release);
}

static void audioLogCallback(Audio::msg_t m) {
  Serial.printf("Audio %s: %s\n", m.s ? m.s : "", m.msg ? m.msg : "");
}

// Twarde wylaczenie wzmacniacza (pin moze byc w dowolnym stanie po wybudzeniu).
static void amplifierOff() {
  pinMode(pins::PA_ENABLE, OUTPUT);
  digitalWrite(pins::PA_ENABLE, LOW);
}

// ES7210 (4-kanalowy ADC mikrofonow, I2C 0x40 na wspolnej szynie) — firmware go
// nie uzywa, ale siedzi na stale zasilonej szynie A3V3 z MICBIAS dla dwoch
// mikrofonow MEMS, a stan po power-on jest nieudokumentowany. Jawny power-down
// (~10 uA wg datasheetu); sekwencja 1:1 z es7210_stop() referencyjnego drivera
// Waveshare (esp_codec_dev). Wolane raz w setup(), gdy Wire juz dziala.
static void es7210PowerDown() {
  auto wr = [](uint8_t reg, uint8_t val) {
    Wire.beginTransmission(0x40);
    Wire.write(reg);
    Wire.write(val);
    return Wire.endTransmission() == 0;
  };
  wr(0x00, 0xFF); wr(0x00, 0x41);                                 // wake-up reset: czesc
                                                                  //  rewizji ignoruje zapisy bez tego
  wr(0x47, 0xFF); wr(0x48, 0xFF); wr(0x49, 0xFF); wr(0x4A, 0xFF); // MIC1..4 off
  wr(0x4B, 0xFF); wr(0x4C, 0xFF);                                 // zasilanie + bias MIC12/34 off
  wr(0x40, 0xC0);                                                 // sekcja analogowa off
  wr(0x01, 0x7F);                                                 // zegary off
  wr(0x06, 0x07);                                                 // power down
}

// ============================================================================
//  [10] POMOCNICZE FUNKCJE PANELU WWW (czyste, bez stanu)
// ============================================================================
static String htmlEscape(const String &v) {
  String out; out.reserve(v.length() + 8);
  for (size_t i = 0; i < v.length(); i++) {
    char c = v[i];
    if (c == '&') out += F("&amp;");
    else if (c == '<') out += F("&lt;");
    else if (c == '>') out += F("&gt;");
    else if (c == '"') out += F("&quot;");
    else if (c == '\'') out += F("&#39;");
    else out += c;
  }
  return out;
}

// "HH:MM" lub "HH:MM:SS" (dowolne biale znaki na koncu). false = odrzucone.
static bool parseClock(const String &v, uint8_t *h, uint8_t *mi, uint8_t *s) {
  int hh = 0, mm = 0, ss = 0, consumed = 0;
  int n = sscanf(v.c_str(), "%d:%d:%d%n", &hh, &mm, &ss, &consumed);
  if (n == 2) { ss = 0; consumed = 0; if (sscanf(v.c_str(), "%d:%d%n", &hh, &mm, &consumed) != 2) return false; }
  if (n < 2 || hh < 0 || hh > 23 || mm < 0 || mm > 59 || ss < 0 || ss > 59) return false;
  while (consumed < (int)v.length() && isspace((unsigned char)v[consumed])) consumed++;
  if (consumed != (int)v.length()) return false;
  *h = (uint8_t)hh; *mi = (uint8_t)mm; *s = (uint8_t)ss;
  return true;
}

static String currentTimeText() {
  struct tm t;
  if (!getLocalTm(&t)) return "czas nieustawiony";
  char buf[48];
  snprintf(buf, sizeof(buf), "%04d-%02d-%02d %02d:%02d:%02d",
           t.tm_year + 1900, t.tm_mon + 1, t.tm_mday, t.tm_hour, t.tm_min, t.tm_sec);
  return String(buf);
}

