Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
static bool isMp3NameChar(char c) {
  return (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
         (c >= '0' && c <= '9') || c == '_' || c == '-' || c == '.';
}

// keepCase: kasowanie musi uzyc dokladnie nazwy z listy (FS rozroznia wielkosc liter).
static bool normalizeMp3Path(String name, String &path, bool keepCase) {
  name.trim(); name.replace("\\", "/");
  int slash = name.lastIndexOf('/');
  if (slash >= 0) name = name.substring(slash + 1);
  name.trim();
  if (name.length() < 5 || name.length() > 25) return false;   // SPIFFS: pelna sciezka <=31 znakow
  String lower = name; lower.toLowerCase();
  if (!lower.endsWith(".mp3")) return false;
  if (!keepCase) name = lower;
  for (size_t i = 0; i < name.length(); i++) if (!isMp3NameChar(name[i])) return false;
  path = String("/") + name;
  return true;
}

static String formatFileSize(size_t bytes) {
  if (bytes < 1024) return String((uint32_t)bytes) + " B";
  if (bytes < 1024UL * 1024UL) return String(bytes / 1024.0f, 1) + " KB";
  return String(bytes / (1024.0f * 1024.0f), 2) + " MB";
}

// ============================================================================
//  [11] Es8311Codec — sterownik kodeka (sekwencja rejestrow: port z es8311.c).
//  Samowystarczalny; szyne I2C dostaje w konstruktorze.
// ============================================================================
class Es8311Codec {
public:
  explicit Es8311Codec(TwoWire &bus) : wire_(bus) {}

  bool begin(int32_t sda, int32_t scl, uint32_t freq) {
    if (sda < 0 || scl < 0) return false;
    wire_.begin(sda, scl, freq);
    wire_.beginTransmission(es8311::I2C_ADDR);
    if (wire_.endTransmission() != 0) return false;

    // Sekwencja startowa 1:1 z referencyjnego es8311.c (esp_codec_dev):
    // pelny reset -> power-up -> zegary 48 kHz/MCLK=256*fs -> I2S 16 bit ->
    // power-up analogowy DAC -> unmute.
    bool ok = true;
    ok &= write(es8311::REG_RESET, 0x1F);
    delay(20);
    ok &= write(es8311::REG_RESET, 0x00);
    ok &= write(es8311::REG_RESET, 0x80);       // power-on, tryb slave
    ok &= write(es8311::REG_CLK_MGR1, 0x3F);    // wlacz wszystkie galezie zegarow
    ok &= write(0x06, read(0x06) & ~(1 << 5));  // BCLK invert off
    ok &= configSampleRate48k();
    ok &= configBits16();
    ok &= write(0x0D, 0x01);                    // power-up sekcji analogowej
    ok &= write(0x0E, 0x02);                    // wlacz DAC (PDN_DAC=0)
    ok &= write(0x12, 0x00);                    // wyjscie DAC nieodwracane
    ok &= write(0x13, 0x10);                    // HP switch on
    ok &= write(0x1C, 0x6A);                    // ustawienia ADC/eq zgodne z portem
    ok &= write(0x37, 0x08);                    // DAC ramp rate
    return ok;
  }

  bool configBits16() { return write(es8311::REG_SDP_IN, 0x0C) && write(es8311::REG_SDP_OUT, 0x0C); }

  // Glosnosc 0..100% -> rejestr DAC (0..DAC_VOLUME_MAX).
  bool setVolume(uint8_t percent) {
    if (percent > 100) percent = 100;
    uint8_t reg = (uint8_t)(((uint16_t)percent * es8311::DAC_VOLUME_MAX) / 100u);
    return write(es8311::REG_DAC_VOLUME, reg);
  }

  // Pelne uspienie: sekwencja suspend z referencyjnego es8311.c (esp-adf) +
  // user guide 9.1/9.2. Sam reset (0x00=0x1F) NIE cofa rejestrow analogowych
  // zapisanych w begin() — bez ponizszych zapisow bias analogowy (~6 mA na
  // stale zasilonej szynie A3V3) grzeje sie na zawsze od pierwszego
  // odtworzenia. Kolejnosc: mute -> analog off -> zegary off -> reset.
  bool powerDown() {
    bool ok = true;
    ok &= write(es8311::REG_DAC_VOLUME, 0x00);
    ok &= write(0x17, 0x00);              // glosnosc ADC = 0
    ok &= write(0x0E, 0xFF);              // PDN_PGA/PDN_MOD/RST_MOD: tor nagrywania off
    ok &= write(0x12, 0x02);              // PDN_DAC=1
    ok &= write(0x14, 0x00);              // mux wejsciowy off, PGA 0
    ok &= write(0x0D, 0xFA);              // bias/VREF analogowe off (0xFA jak esp-adf:
                                          //  VMID zostaje -> wznowienie bez strzalu)
    ok &= write(0x15, 0x00);
    ok &= write(0x37, 0x08);
    ok &= write(0x45, 0x01);
    ok &= write(es8311::REG_CLK_MGR1, 0x00);  // wszystkie galezie zegarow zamkniete
    ok &= write(es8311::REG_RESET, 0x1F);     // CSM off + reset — NA KONCU
    return ok;
  }

private:
  TwoWire &wire_;

  bool write(uint8_t reg, uint8_t value) {
    wire_.beginTransmission(es8311::I2C_ADDR);
    wire_.write(reg);
    wire_.write(value);
    return wire_.endTransmission() == 0;
  }
  uint8_t read(uint8_t reg) {
    wire_.beginTransmission(es8311::I2C_ADDR);
    wire_.write(reg);
    wire_.endTransmission(false);
    wire_.requestFrom((uint16_t)es8311::I2C_ADDR, (uint8_t)1, true);
    return wire_.available() ? wire_.read() : 0;
  }
  bool configSampleRate48k() {
    bool ok = true;
    ok &= write(0x02, 0x00);                    // preskalery MCLK
    ok &= write(0x03, 0x10);
    ok &= write(0x04, 0x10);
    ok &= write(0x05, 0x00);
    ok &= write(0x06, (read(0x06) & 0xE0) | 0x03);
    ok &= write(0x07, 0x00);
    ok &= write(0x08, 0xFF);
    return ok;
  }
};

// ============================================================================
//  [12] DebouncedButton — debouncer + pomiar czasu wcisniecia jako mala maszyna
//  stanow. Jedna klasa obsluguje oba przyciski (KEY i PREVIEW/BOOT); polityka
//  "co znaczy krotkie/dlugie" nalezy do ButtonInput, nie do debouncera.
// ============================================================================
class DebouncedButton {
public:
  explicit DebouncedButton(gpio_num_t pin) : pin_(pin) {}

  // pinMode + zdjecie stanu poczatkowego BEZ generowania zdarzenia Pressed
  // (przycisk trzymany podczas startu nie wywoluje akcji az do zwolnienia).
  // Gdy pin juz jest wcisniety, uzbrajamy pomiar czasu — zwolnienie dostanie
  // zmierzona dlugosc przytrzymania zamiast "nieznanej".
  void begin() {
    pinMode(pin_, INPUT_PULLUP);
    rawLevel_ = stableLevel_ = digitalRead(pin_);
    lastChangeMs_ = millis();
    pressStartMs_ = millis();
    pressStartKnown_ = (stableLevel_ == LOW);
  }

