Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
  // Wolane co obieg petli. Zwraca zdarzenie krawedziowe po debounce.
  ButtonEvent poll() {
    bool raw = digitalRead(pin_);
    uint32_t now = millis();
    if (raw != rawLevel_) { rawLevel_ = raw; lastChangeMs_ = now; }
    if (now - lastChangeMs_ > btncfg::DEBOUNCE_MS && raw != stableLevel_) {
      stableLevel_ = raw;
      if (stableLevel_ == LOW) {
        pressStartMs_ = now;
        pressStartKnown_ = true;
        return ButtonEvent::Pressed;
      }
      lastPressKnown_ = pressStartKnown_;
      lastPressDurationMs_ = pressStartKnown_ ? (now - pressStartMs_) : 0;
      pressStartKnown_ = false;
      return ButtonEvent::Released;
    }
    return ButtonEvent::None;
  }

  // Wybudzenie ze snu przyciskiem: pin JUZ jest wcisniety, a zbocza nie bylo —
  // ustaw stan "wcisniety od teraz", by zwolnienie zmierzylo czas przytrzymania.
  // (begin() robi to samo dla przycisku trzymanego od startu — fix v8.0: dlugie
  //  przytrzymanie od bootu nie odpala juz akcji krotkiej przy zwolnieniu.)
  void primePressed() {
    uint32_t now = millis();
    rawLevel_ = stableLevel_ = LOW;
    lastChangeMs_ = now;
    pressStartMs_ = now;
    pressStartKnown_ = true;
  }

  bool isDown() const { return stableLevel_ == LOW; }

  // Wazne tylko bezposrednio po ButtonEvent::Released:
  // known=false gdy poczatku nacisniecia nie widzielismy (np. trzymany od bootu).
  bool     lastPressKnown() const      { return lastPressKnown_; }
  uint32_t lastPressDurationMs() const { return lastPressDurationMs_; }

private:
  gpio_num_t pin_;
  bool     rawLevel_ = HIGH;
  bool     stableLevel_ = HIGH;
  uint32_t lastChangeMs_ = 0;
  uint32_t pressStartMs_ = 0;
  bool     pressStartKnown_ = false;
  bool     lastPressKnown_ = false;
  uint32_t lastPressDurationMs_ = 0;
};

// ============================================================================
//  Koordynator (forward) — klasy logiki dostaja App& jako mediator do rodzenstwa
//  plus bezposrednie referencje do sprzetu, ktorym same steruja.
// ============================================================================
class App;

// ============================================================================
//  [13] RtcController — PCF85063A: czas (z wyrownaniem fazy), offset, alarm
//  wybudzajacy. Zalezy WYLACZNIE od szyny I2C (bez App — czysty sterownik+polityka).
// ============================================================================
class RtcController {
public:
  explicit RtcController(TwoWire &bus) : wire_(bus) {}

  bool readToSystem();
  bool readEpoch(time_t *epoch);                    // requireCurrentFormat = true
  bool writeTime(time_t epoch, bool audioActive);   // audioActive: pomija wyrownanie fazy
  bool ensureOffsetCalibration();
  bool setWakeAlarm(time_t epoch);
  bool disableWakeAlarm();
#if ENABLE_RTC_AUTOTRIM
  void setTargetOffsetLsb(int8_t lsb) { targetOffsetReg_ = encodeRtcOffset(lsb, false); }
  bool applyOffsetLsb(int8_t lsb);                  // zapis+weryfikacja rejestru 0x02
  bool measureDriftUs(int64_t *driftUs);            // faza RTC vs czas systemowy (~ms)
#endif

  // Diagnostyka offsetu (do /info).
  uint8_t offsetRaw() const       { return offsetRaw_; }
  uint8_t targetOffsetRaw() const { return targetOffsetReg_; }
  int8_t  offsetLsb() const       { return offsetLsb_; }
  float   offsetPpm() const       { return offsetPpm_; }
  bool    offsetVerified() const  { return offsetVerified_; }

private:
  TwoWire &wire_;
  uint8_t targetOffsetReg_ = rtccfg::FACTORY_OFFSET_REG;  // docelowe 0x02 (NVS moze nadpisac)
  uint8_t offsetRaw_      = 0xFF;
  int8_t  offsetLsb_      = 0;
  float   offsetPpm_      = 0.0f;
  bool    offsetVerified_ = false;

  bool recoverStuckBus();
  bool beginSession();
  bool writeReg(uint8_t reg, uint8_t value);
  bool readRegs(uint8_t reg, uint8_t *buf, uint8_t n);
  bool readControl1(uint8_t *control1);
  bool readControl2(uint8_t *control2);
  bool writeControl1(uint8_t control1);
  bool releaseClock(uint8_t runningControl1);
  bool prepareTimeWrite(uint8_t *runningControl1);
  bool hasCurrentFormat();
  bool storeCurrentFormat();
  bool invalidateCurrentFormat();
  bool readEpochInternal(time_t *epoch, bool requireCurrentFormat);
  bool configureWakeInterrupt(bool alarmEnabled);
  bool verifyWakeInterruptConfig(bool alarmEnabled);
  bool verifyWakeAlarm(time_t epoch);
};

// ============================================================================
//  [14] SoundStore — system plikow MP3 (SPIFFS/LittleFS/FFat), montowany leniwie.
// ============================================================================
class SoundStore {
public:
  bool ensureMounted();
  fs::FS *fs() const { return fs_; }
  // Nazwy renderowane w panelu WWW i /info — musza zostac znakowo identyczne z v7.x.
  const char *name() const {
    switch (backend_) {
      case FsBackend::Spiffs:   return "SPIFFS";
      case FsBackend::LittleFs: return "LittleFS";
      case FsBackend::FFatFs:   return "FFat";
      default:                  return "brak";
    }
  }

private:
  FsBackend   backend_     = FsBackend::None;
  fs::FS     *fs_          = nullptr;
  bool        formatTried_ = false;
  bool recoverSoundFilesOnce();
  void recoverSoundFiles();
};

// ============================================================================
//  [15] BatteryMonitor — ADC, krzywa OCV->SoC, estymator zuzycia, ochrona ogniwa
// ============================================================================
class BatteryMonitor {
public:
  explicit BatteryMonitor(App &app) : app_(app) {}

  bool init();
  void update(bool force);
  uint8_t percent() const    { return g_persist.batteryPercent; }
  float   voltage() const    { return g_persist.batteryVoltage; }
  bool    hasReading() const { return g_persist.batteryHasReading; }
#if ENABLE_LOW_BATTERY_PROTECT
  bool isLow() const;
  bool isCritical() const;
#endif

private:
  App &app_;
  adc_oneshot_unit_handle_t adc_  = nullptr;
  adc_cali_handle_t         cali_ = nullptr;
  bool     ready_      = false;
  bool     caliReady_  = false;
  uint32_t nextReadMs_ = 0;

  static uint8_t percentFromVoltage(float v);
  uint8_t stabilizePercent(uint8_t measured) const;
  void    maybeWriteDailySummary(time_t now);
};

// ============================================================================
//  [16] AudioPlayer — odtwarzanie MP3 (ES8311 + I2S) oraz petla "dzwonienia".
//  Sprzet (dekoder audioI2S + kodek) wstrzykniety w konstruktorze.
// ============================================================================
class AudioPlayer {
public:
  AudioPlayer(App &app, Audio &decoder, Es8311Codec &codec)
    : app_(app), decoder_(decoder), codec_(codec) {}

