Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
  bool ensureCodec();
  void shutdownCodec();
  void codecPowerDown();        // ES8311 w stan niskiego poboru (setup)
  bool startSound(uint8_t soundIndex, uint8_t volume);
  void stopPlayback(StopCause cause);
  void startRinging(int alarmIndex);
  void serviceAudio();
  void serviceRinging();

  bool isPlaying() const   { return playing_; }
  bool isRinging() const   { return ringing_; }
  bool codecActive() const { return ready_; }    // kodek nie uspiony (idlePowerSave)

private:
  App         &app_;
  Audio       &decoder_;
  Es8311Codec &codec_;

  void ensurePins();
  bool     pinsReady_ = false;
  bool     ready_     = false;     // kodek skonfigurowany i zasilony
  bool     playing_   = false;
  uint32_t soundStartedMs_ = 0;
  // stan dzwonienia budzika
  bool     ringing_         = false;
  int      ringingAlarm_    = -1;
  uint32_t ringStartMs_     = 0;
  uint32_t ringLastRetryMs_ = 0;
  uint8_t  ringErrors_      = 0;
};

// ============================================================================
//  [17] AlarmScheduler — model budzikow, harmonogram wyzwolen, dedup kolizji DST
// ============================================================================
class AlarmScheduler {
public:
  explicit AlarmScheduler(App &app) : app_(app) {}

  void setDefaults();
  void resetTriggerState();
  void sanitize(int index);
  void sanitizeAll();
  AlarmConfig       &config(int i)       { return alarms_[i]; }
  const AlarmConfig &config(int i) const { return alarms_[i]; }
  void              *rawData()           { return alarms_.data(); }   // NVS getBytes/putBytes
  size_t             rawSize() const     { return sizeof(alarms_); }

  bool anyEnabled() const;
  NextAlarmInfo nextAlarm() const;
  void checkAlarms(uint32_t lateWindowSec = alarmcfg::LATE_WINDOW_SEC);

  // Uzywane przez PowerPlanner przy planowaniu snu.
  bool   anyDueNow(const struct tm &t) const;
  time_t nextEpoch(const struct tm &base, time_t now) const;

private:
  App &app_;
  std::array<AlarmConfig, alarmcfg::ALARM_COUNT> alarms_;
  int  pendingAlarm_ = -1;   // budzik wymagalny podczas dzwonienia innego (fix v8.0)

  void queueWhileRinging(const struct tm &t, time_t now, uint32_t lateWindowSec);
  bool firePendingIfAny();
  // rawSize() zasila kontrakt NVS — std::array nie moze dolozyc paddingu.
  static_assert(sizeof(std::array<AlarmConfig, alarmcfg::ALARM_COUNT>) ==
                alarmcfg::ALARM_COUNT * sizeof(AlarmConfig), "NVS blob 'alarms'");
};

// ============================================================================
//  [18] NetworkTimeService — WiFi + NTP: nieblokujaca maszyna stanow (NtpState)
//  + harmonogram dobowy. Czas z RTC pierwszy; NTP NADPISUJE tylko po REALNYM
//  pakiecie (gate atomic).
// ============================================================================
class NetworkTimeService {
public:
  explicit NetworkTimeService(App &app) : app_(app) {}

  void syncNow(SyncTrigger trigger);
  bool service();                       // true gdy NTP wlasnie zatwierdzil nowy czas
  void checkSchedule();                 // dobowa synchronizacja 18:00 (+ dogonienie)
  void handleRtcWriteRetry();
  void stopWifiAndNtp();
  bool ensureWifi(uint32_t timeoutMs);  // blokujace laczenie (tylko panel WWW)

  void setRetries(uint8_t n)   { retriesLeft_ = n; }
  bool isBusy() const          { return state_ != NtpState::Idle; }
  bool rtcWritePending() const { return rtcWriteRetriesLeft_ != 0; }
  long secsSinceLastSync() const;

  const char *ssid() const { return ssid_; }
  const char *pass() const { return pass_; }   // tylko do zapisu NVS (NIE renderowane w HTML)
  void setCreds(const char *s, const char *p);
  void setSsid(const String &s);
  void setPass(const String &p);

private:
  App           &app_;
  NtpState       state_          = NtpState::Idle;
  bool           manualAttempt_  = false;
  bool           wifiHintActive_ = false;
  uint32_t       stateStartedMs_ = 0;
  struct timeval fallbackTime_   = {};   // snapshot czasu przed proba (rollback po bledzie)
  uint8_t        retriesLeft_ = 0;
  uint32_t       nextRetryMs_ = 0;
  uint32_t       backoffMs_   = ntpcfg::BACKOFF_MIN_MS;
  uint32_t       wifiLostMs_  = 0;       // od kiedy WiFi zerwane w trakcie WaitingForPacket
  uint8_t        rtcWriteRetriesLeft_ = 0;
  uint32_t       rtcWriteNextRetryMs_ = 0;
  char           ssid_[33] = "";
  char           pass_[65] = "";

  static void wifiPowerOff() { WiFi.disconnect(false, false); WiFi.mode(WIFI_OFF); }
  static void copyBounded(char *dst, size_t dstSize, const char *src);
  bool wifiBeginSmart();
  void wifiRetryFullScan();
  void wifiCacheHint();
  void stopSntpCallbacks();
  void restoreTimeAfterFailedNtp();
  void beginNtpRequest();
  void failNtpAttempt(const char *status);   // wspolna sciezka porazki w WaitingForPacket
  void finishNtpAttempt(bool ok);
  bool handleNtpRetry();
  void scheduleRtcWriteRetry(uint8_t retries = rtccfg::WRITE_RETRIES);
#if ENABLE_RTC_AUTOTRIM
  void maybeAutotrimRtc(time_t syncedEpoch);
#endif
};

// ============================================================================
//  [19] DisplayUi — strony ekranu (U8g2) + dedup repaintu przez sygnature widoku.
//  ClockView to zdjecie WIDOCZNEJ tresci strony zegara: render i anty-mruganie
//  pracuja na tych samych danych, liczonych raz na obieg.
// ============================================================================
struct ClockView {
  uint8_t  hour, minute;
  int      dayKey;
  uint8_t  batteryPercent;
  bool     webActive;
  bool     anyAlarmEnabled;
  bool     hasNextAlarm;
  uint8_t  nextAlarmHour, nextAlarmMinute;

  // FNV-1a po widocznej tresci. Pola niepokazywane (ntpStatus/statusText) NIE
  // wchodza -> zero pelnych sendBuffer() identycznej klatki (zero mrugniec
  // panelu refleksyjnego).
  uint32_t signature() const {
    constexpr uint32_t FNV_OFFSET_BASIS = 2166136261u;
    constexpr uint32_t FNV_PRIME        = 16777619u;
    uint32_t h = FNV_OFFSET_BASIS;
    auto mix = [&](uint32_t v) { h = (h ^ v) * FNV_PRIME; };
    mix(hour);
    mix(minute);
    mix((uint32_t)dayKey);
    mix(batteryPercent);
    mix(webActive ? 1u : 0u);
    mix(anyAlarmEnabled ? 1u : 0u);
    mix(hasNextAlarm ? (uint32_t)(nextAlarmHour * 60 + nextAlarmMinute + 1) : 0u);
    return h;
  }
};

class DisplayUi {
public:
  DisplayUi(App &app, RlcdDisplay &panel) : app_(app), panel_(panel) {}

