Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
  void setup();                     // pelny re-init panelu (zimny start i po deep-sleep)
  void update();                    // dispatcher stron wg UiPage
  void drawNightPage();             // wolane przez PowerPlanner przed deep-sleep
#if ENABLE_LOW_BATTERY_PROTECT
  void drawCriticalBatteryPage();   // jw. przed ochronnym snem
#endif

private:
  App         &app_;
  RlcdDisplay &panel_;
  uint32_t     lastClockSig_ = FORCE_REPAINT_SIG;

  static constexpr uint32_t FORCE_REPAINT_SIG = 0xFFFFFFFFu;  // sentinel = wymus repaint

  // --- uklad strony zegara (wspolrzedne w px; panel 400x300 landscape) ---
  static constexpr int BATTERY_ICON_X   = 360;
  static constexpr int BATTERY_ICON_Y   = 8;
  static constexpr int FOOTER_LINE_Y    = 264;
  static constexpr int FOOTER_TEXT_Y    = 287;
  static constexpr int FOOTER_TEXT_X    = 42;
  static constexpr int FOOTER_BELL_X    = 10;
  static constexpr int FOOTER_BELL_Y    = 270;

  UiPage    resolvePage() const;
  ClockView makeClockView(const struct tm &t, int dayKey) const;
  void      renderTimePages();      // NoTime / Clock (wspolne dla update i wygasniecia podgladu)
  void      drawPhotoGlyph(int x, int y, int glyph, bool colon);
  void      drawLargeTime(uint8_t hour, uint8_t minute, int y);
  void      drawBellIcon(int x, int y, bool active);
  void      drawBatteryIcon(int x, int y, uint8_t percent);
  void      drawCentered(const char *text, int y);
  void      drawClockPage(const ClockView &view);
  void      drawPreviewPage();
  void      drawRingingPage();
  void      drawNoTimePage();
};

// ============================================================================
//  [20] WebPanel — panel konfiguracji, sync, pliki MP3, /info (WiFi na zadanie)
// ============================================================================
class WebPanel {
public:
  WebPanel(App &app, WebServer &server) : app_(app), server_(server) {}

  bool startWebWindow();
  void service();              // obsluga w loop(): grace WiFi + handleClient + timeout
  bool isActive() const { return active_; }
  void forceStop();            // server.stop + active_=false (przy zasypianiu nocnym)

private:
  App       &app_;
  WebServer &server_;
  bool       active_          = false;
  bool       routesInstalled_ = false;
  uint32_t   untilMs_         = 0;
  uint32_t   wifiLostMs_      = 0;

  File     mp3UploadFile_;
  bool     mp3UploadAccepted_ = false;
  bool     mp3UploadHadData_  = false;
  String   mp3UploadPath_     = "";
  String   mp3UploadTempPath_ = "";

  void stopWindow();
  void installRoutes();
  void redirectHome();        // 303 -> "/" (wspolne zakonczenie akcji POST/GET)
  void extendWindow()  { untilMs_ = millis() + webcfg::WINDOW_MS; }
  void appendMp3Manager(String &html);
  void pageHeader(String &h);
  void handleRoot();
  void handleSave();
  void handleSync();
  void handleStop();
  void handleTest();
  void handleMp3UploadDone();
  void handleMp3UploadStream();
  void discardUploadTemp();   // sprzatanie .part po pustym/przerwanym uploadzie
  void handleMp3Delete();
  void handleWebOff();
#if ENABLE_DIAGNOSTICS
  void handleInfo();
#endif
};

// ============================================================================
//  [21] PowerPlanner — tryb nocny (deep-sleep), light-sleep dzienny, ochronny sen
// ============================================================================
class PowerPlanner {
public:
  explicit PowerPlanner(App &app) : app_(app) {}

  void releaseNightHolds();
  void enterNightSleepIfNeeded(bool force);
  void idlePowerSave();
#if ENABLE_LOW_BATTERY_PROTECT
  void enterCriticalBatterySleepIfNeeded();
#endif

private:
  App &app_;
  void     holdNightPins();
  void     shutdownNightPeripherals();
  // Wspolne zejscie do deep-sleep (noc + ochrona ogniwa): peryferia off, CPU w dol,
  // timer + EXT1 z pull-upami, hold pinow, flush. NIE WRACA.
  [[noreturn]] void beginDeepSleep(uint64_t sleepUs, uint64_t ext1Mask);
  time_t   nightEndEpoch(time_t now);
  uint64_t computeIdleSleepUs();
};

// ============================================================================
//  [22] ButtonInput — polityka przyciskow (co znaczy krotkie/dlugie nacisniecie)
//  + stan podgladu budzika i okna utrzymania wybudzenia.
// ============================================================================
class ButtonInput {
public:
  explicit ButtonInput(App &app)
    : app_(app), keyButton_(pins::KEY), previewButton_(pins::PREVIEW) {}

  void begin();
  void pollKey();
  void pollPreview();
  void showPreview();
  void primeKeyFromSetup();           // KEY z deep-sleep: zacznij mierzyc nacisniecie (bez wakeHold)
  void primeKeyFromLightSleepWake();  // wybudzenie z light-sleep: jw. + utrzymaj wybudzenie
  void onPreviewWakeFromLightSleep(); // wybudzenie z light-sleep przyciskiem PREVIEW

  void holdWake()           { wakeHoldUntilMs_ = millis() + btncfg::WAKE_HOLD_MS; }
  bool wakeHeld() const     { return (int32_t)(millis() - wakeHoldUntilMs_) < 0; }
  bool previewActive() const       { return previewActive_; }
  bool previewWithinWindow() const { return (int32_t)(millis() - previewUntilMs_) < 0; }
  void clearPreview()              { previewActive_ = false; }

private:
  App            &app_;
  DebouncedButton keyButton_;
  DebouncedButton previewButton_;
  bool            previewActive_  = false;
  uint32_t        previewUntilMs_ = 0;
  uint32_t        wakeHoldUntilMs_ = 0;
};

// ============================================================================
//  [23] SettingsStore — NVS (budziki + WiFi + offset RTC + liczniki resetow).
//  JEDYNA klasa dotykajaca Preferences: pelna kontrola nad kluczami i zgodnoscia.
// ============================================================================
// Straznik RAII sesji Preferences: kazde wyjscie z funkcji (takze wczesny return)
// domyka NVS. Zero heapu, zero wyjatkow.
class NvsSession {
public:
  explicit NvsSession(Preferences &prefs)
    : prefs_(prefs), open_(prefs.begin(nvskeys::NAMESPACE_NAME, false)) {}
  ~NvsSession() { if (open_) prefs_.end(); }
  explicit operator bool() const { return open_; }
  NvsSession(const NvsSession &) = delete;
  NvsSession &operator=(const NvsSession &) = delete;

