Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
private:
  Preferences &prefs_;
  bool         open_;
};

class SettingsStore {
public:
  SettingsStore(App &app, Preferences &prefs) : app_(app), prefs_(prefs) {}

  void load();
  void save();
  void saveDrainSummary(uint8_t soc, float mahPerDay, int day);
#if ENABLE_RTC_AUTOTRIM
  void saveRtcOffset(int8_t lsb);   // tylko klucz "rtcOffLsb" (bez przepisywania reszty)
#endif
#if ENABLE_DIAGNOSTICS
  void     recordResetReason(esp_reset_reason_t r);
  uint32_t brownoutResets() const { return brownoutResets_; }
  uint32_t wdtResets() const      { return wdtResets_; }
  uint32_t panicResets() const    { return panicResets_; }
#endif

private:
  App         &app_;
  Preferences &prefs_;
#if ENABLE_DIAGNOSTICS
  uint32_t brownoutResets_ = 0;
  uint32_t wdtResets_      = 0;
  uint32_t panicResets_    = 0;
#endif
};

// ============================================================================
//  [24] App — koordynator (mediator). Trzyma wszystkie moduly i stan UI; sprzet
//  dostaje w konstruktorze i rozdaje modulom przez referencje (lekki DI: kazdy
//  modul widzi tylko to, czym steruje, a rodzenstwo osiaga przez App&).
// ============================================================================
class App {
public:
  App(TwoWire &i2c, RlcdDisplay &panel, WebServer &server, Preferences &prefs, Audio &decoder)
    : rtc_(i2c), codec_(i2c),
      battery_(*this), audio_(*this, decoder, codec_), alarms_(*this),
      ntp_(*this), display_(*this, panel), web_(*this, server), power_(*this),
      buttons_(*this), settings_(*this, prefs) {}

  void setup();
  void loop();

  // --- mediator: dostep do rodzenstwa ---
  SoundStore         &soundStore() { return soundStore_; }
  RtcController      &rtc()        { return rtc_; }
  BatteryMonitor     &battery()    { return battery_; }
  AudioPlayer        &audio()      { return audio_; }
  AlarmScheduler     &alarms()     { return alarms_; }
  NetworkTimeService &ntp()        { return ntp_; }
  DisplayUi          &displayUi()  { return display_; }
  WebPanel           &web()        { return web_; }
  PowerPlanner       &power()      { return power_; }
  ButtonInput        &buttons()    { return buttons_; }
  SettingsStore      &settings()   { return settings_; }
  PersistentState    &persist()    { return g_persist; }

  // --- stan UI (flaga repaintu + teksty statusow) ---
  void markDirty()                   { dirty_ = true; }
  void clearDirty()                  { dirty_ = false; }
  bool dirty() const                 { return dirty_; }
  void setStatus(const String &s)    { statusText_ = s; }
  const String &statusText() const   { return statusText_; }
  void setNtpStatus(const String &s) { ntpStatus_ = s; }
  const String &ntpStatus() const    { return ntpStatus_; }

  // --- bramki wspoldzielone ---
  bool audioActive() const { return audio_.isPlaying() || audio_.isRinging(); }
  // Stan, w ktorym NIE wolno uspic na dlugo (jedna definicja dla wszystkich snow).
  bool busy() const {
    return audioActive() || web_.isActive() || buttons_.previewActive() ||
           ntp_.isBusy() || ntp_.rtcWritePending();
  }

private:
  SoundStore         soundStore_;
  RtcController      rtc_;
  Es8311Codec        codec_;
  BatteryMonitor     battery_;
  AudioPlayer        audio_;
  AlarmScheduler     alarms_;
  NetworkTimeService ntp_;
  DisplayUi          display_;
  WebPanel           web_;
  PowerPlanner       power_;
  ButtonInput        buttons_;
  SettingsStore      settings_;

  bool     dirty_      = true;
  String   statusText_ = "IDLE";
  String   ntpStatus_  = "never";
  uint32_t lastAlarmCheckMs_ = 0;   // loop(): poszerza okno spoznienia o przestoj petli
};

// Jedyna instancja koordynatora — tu widac cale okablowanie sprzetu.
static App app(Wire, display, httpServer, preferences, audioOutput);

// ============================================================================
//  IMPLEMENTACJE — RtcController (PCF85063A)
// ============================================================================
// Odblokowanie zawieszonej szyny I2C: slave (RTC/kodek) trzymajacy SDA nisko po
// resecie ESP w polowie transakcji zwalnia ja po maks. 9 impulsach SCL + STOP.
// Bez tego kazda sesja RTC pada az do odlaczenia zasilania. Zwraca true, gdy
// szyna byla zawieszona i zostala uwolniona.
bool RtcController::recoverStuckBus() {
  // Sonda BEZ pinMode: rekonfiguracja pinu I2C w core 3.x przechodzi przez
  // Peripheral Manager i deinicjalizuje caly sterownik Wire (wspoldzielony z
  // ES8311) — nawet przy zwyklym NACK. gpio_get_level czyta stan szyny nie
  // dotykajac konfiguracji (bufor wejsciowy SDA wlaczony przez sterownik I2C).
  if (gpio_get_level(pins::I2C_SDA) == 1) return false;   // SDA wolne -> zwykly NACK
  wire_.end();                                            // jawny demontaz PRZED przejeciem pinow
  pinMode(pins::I2C_SDA, INPUT_PULLUP);
  pinMode(pins::I2C_SCL, OUTPUT_OPEN_DRAIN);
  digitalWrite(pins::I2C_SCL, HIGH);
  for (uint8_t i = 0; i < i2cbus::RECOVER_MAX_PULSES && digitalRead(pins::I2C_SDA) == LOW; i++) {
    digitalWrite(pins::I2C_SCL, LOW);  delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
    digitalWrite(pins::I2C_SCL, HIGH); delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
  }
  pinMode(pins::I2C_SDA, OUTPUT_OPEN_DRAIN);              // warunek STOP: SDA lo->hi przy SCL hi
  digitalWrite(pins::I2C_SDA, LOW);  delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
  digitalWrite(pins::I2C_SDA, HIGH); delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
  bool freed = digitalRead(pins::I2C_SDA) == HIGH;
  Serial.printf("I2C: szyna zawieszona -> odzysk %s\n", freed ? "OK" : "NIEUDANY");
  return freed;
}

bool RtcController::beginSession() {
  wire_.begin(pins::I2C_SDA, pins::I2C_SCL);
  wire_.setClock(i2cbus::FREQ_HZ);
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  if (wire_.endTransmission() == 0) return true;
  if (!recoverStuckBus()) return false;                   // NACK bez zwisu SDA -> zwykly blad
  wire_.begin(pins::I2C_SDA, pins::I2C_SCL);              // po odzysku pelna re-inicjalizacja
  wire_.setClock(i2cbus::FREQ_HZ);
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  return wire_.endTransmission() == 0;
}

bool RtcController::writeReg(uint8_t reg, uint8_t value) {
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(reg);
  wire_.write(value);
  return wire_.endTransmission() == 0;
}

// Odczyt n rejestrow od 'reg' jednym transferem. Wolajacy juz otworzyl sesje.
bool RtcController::readRegs(uint8_t reg, uint8_t *buf, uint8_t n) {
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(reg);
  if (wire_.endTransmission(false) != 0) return false;
  if (wire_.requestFrom((uint8_t)pcf85063::I2C_ADDR, n) != n) return false;
  for (uint8_t i = 0; i < n; i++) buf[i] = wire_.read();
  return true;
}

