Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
#if ENABLE_RTC_AUTOTRIM
bool RtcController::applyOffsetLsb(int8_t lsb) {
  setTargetOffsetLsb(lsb);
  return ensureOffsetCalibration();
}

// Pomiar dryftu z rozdzielczoscia ~ms zamiast 1 s: czekaj (polling I2C) na
// przewrot sekundy RTC i zlap te chwile wg zegara systemowego. Wolane ZARAZ po
// pakiecie NTP (czas systemowy = wzorzec) i PRZED writeTime (nadpisze faze).
// W przewrocie faza RTC = dokladnie 0.000 s, wiec epokaRTC*1e6 - czas_sys_us
// = dryft narosly od ostatniego wyrownanego zapisu. Blokuje do ~1.3 s — wolac
// tylko bez aktywnego audio (busy-wait zaglodzilby audio.loop()).
bool RtcController::measureDriftUs(int64_t *driftUs) {
  if (!driftUs || !beginSession()) return false;
  uint8_t sec0, sec;
  if (!readRegs(pcf85063::REG_SECONDS, &sec0, 1)) return false;
  sec0 &= 0x7F;
  uint32_t startMs = millis();
  do {
    if (millis() - startMs > rtccfg::BOUNDARY_POLL_TIMEOUT_MS) return false;   // brak przewrotu: oscylator stoi
    if (!readRegs(pcf85063::REG_SECONDS, &sec, 1)) return false;
    sec &= 0x7F;
  } while (sec == sec0);
  struct timeval tv;
  gettimeofday(&tv, nullptr);              // chwila przewrotu wg czasu systemowego
  watchdogFeed();
  time_t rtcEpoch;
  if (!readEpochInternal(&rtcEpoch, true)) return false;
  *driftUs = (int64_t)rtcEpoch * 1000000LL -
             ((int64_t)tv.tv_sec * 1000000LL + (int64_t)tv.tv_usec);
  return true;
}
#endif

// INT sluzy wylacznie alarmowi wybudzajacemu. Wylacz korekcje (CIE), timer i
// CLKOUT (mniejszy pobor RTC); AIE tylko gdy alarm uzbrojony.
bool RtcController::configureWakeInterrupt(bool alarmEnabled) {
  uint8_t control1;
  if (!readControl1(&control1)) return false;
  control1 &= (uint8_t)~pcf85063::CTRL1_CIE;
  if (!writeReg(pcf85063::REG_CONTROL1, control1)) return false;
  if (!writeReg(pcf85063::REG_TIMER_MODE, pcf85063::TIMER_MODE_OFF)) return false;
  if (!writeReg(pcf85063::REG_TIMER_VALUE, 0)) return false;
  uint8_t control2;
  if (!readControl2(&control2)) return false;
  // Zapis control2 kasuje przy okazji flagi AF/TF (pola flagowe piszemy zerem).
  control2 = (uint8_t)(pcf85063::CTRL2_COF_OFF | (alarmEnabled ? pcf85063::CTRL2_AIE : 0));
  return writeReg(pcf85063::REG_CONTROL2, control2);
}

bool RtcController::verifyWakeInterruptConfig(bool alarmEnabled) {
  uint8_t control1, control2;
  if (!readControl1(&control1) || !readControl2(&control2)) return false;
  if (!beginSession()) return false;
  uint8_t timer[2];
  if (!readRegs(pcf85063::REG_TIMER_VALUE, timer, 2)) return false;
  uint8_t expectedControl2 = alarmEnabled ? pcf85063::CTRL2_AIE : 0;
  return (control1 & pcf85063::CTRL1_CIE) == 0 &&
         (control2 & 0xF8) == expectedControl2 &&
         timer[0] == 0 && timer[1] == pcf85063::TIMER_MODE_OFF;
}

bool RtcController::verifyWakeAlarm(time_t epoch) {
  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!beginSession()) return false;
  uint8_t a[5];
  if (!readRegs(pcf85063::REG_SECOND_ALARM, a, 5)) return false;
  if (a[0] != (dec2bcd((uint8_t)gm.tm_sec) & 0x7F) ||
      a[1] != (dec2bcd((uint8_t)gm.tm_min) & 0x7F) ||
      a[2] != (dec2bcd((uint8_t)gm.tm_hour) & 0x3F) ||
      a[3] != (dec2bcd((uint8_t)gm.tm_mday) & 0x3F) ||
      a[4] != pcf85063::ALARM_AEN_OFF) return false;
  return verifyWakeInterruptConfig(true);
}

// Alarm PCF85063A pracuje w UTC (jak rejestry czasu). INT aktywne stanem niskim.
// Odmowa gdy RTC i czas systemowy rozjechane > WAKE_MAX_SKEW_SEC — alarm liczony
// z czasu systemowego musi trafic w czas RTC.
bool RtcController::setWakeAlarm(time_t epoch) {
  time_t systemNow = time(nullptr);
  if (!isSupportedEpoch(epoch) || !isSupportedEpoch(systemNow)) return false;
  time_t rtcNow;
  if (!readEpoch(&rtcNow)) return false;     // odrzuca STOP/12h
  long long rtcSkew = (long long)rtcNow - (long long)systemNow;
  if (rtcSkew < -rtccfg::WAKE_MAX_SKEW_SEC || rtcSkew > rtccfg::WAKE_MAX_SKEW_SEC) return false;
  if (!configureWakeInterrupt(false)) return false;

  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!beginSession()) return false;
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(pcf85063::REG_SECOND_ALARM);
  wire_.write(dec2bcd((uint8_t)gm.tm_sec) & 0x7F); // AEN=0 -> pole aktywne
  wire_.write(dec2bcd((uint8_t)gm.tm_min) & 0x7F);
  wire_.write(dec2bcd((uint8_t)gm.tm_hour) & 0x3F);
  wire_.write(dec2bcd((uint8_t)gm.tm_mday) & 0x3F);
  wire_.write(pcf85063::ALARM_AEN_OFF);            // Weekday_alarm wylaczony
  if (wire_.endTransmission() != 0) return false;

  if (!configureWakeInterrupt(true)) return false;
  return verifyWakeAlarm(epoch);
}

bool RtcController::disableWakeAlarm() {
  return configureWakeInterrupt(false) && verifyWakeInterruptConfig(false);
}

// ============================================================================
//  IMPLEMENTACJE — SoundStore (system plikow MP3)
// ============================================================================
// Dokoncz przerwana instalacje MP3 (patrz WebPanel::handleMp3UploadStream):
// osierocony .bak wraca na miejsce (lub znika, gdy cel istnieje), osierocony
// .part jest sprzatany. Jedno przejscie = jedna naprawa; wolane w petli.
bool SoundStore::recoverSoundFilesOnce() {
  File root = fs_->open("/");
  if (!root) return false;
  for (File f = root.openNextFile(); f; f = root.openNextFile()) {
    bool isDir = f.isDirectory();
    String path = f.name();
    f.close();
    if (isDir) continue;
    if (!path.startsWith("/")) path = String("/") + path;
    String lower = path; lower.toLowerCase();
    if (lower.endsWith(".bak") && path.length() > 5) {
      String target = path.substring(0, path.length() - 4);
      bool changed = fs_->exists(target) ? fs_->remove(path) : fs_->rename(path, target);
      if (changed) { root.close(); return true; }
    } else if (lower.endsWith(".part") && path.length() > 6) {
      String target = path.substring(0, path.length() - 5);
      String backup = target + ".bak";
      if (fs_->exists(backup) && !fs_->exists(target)) continue;
      if (fs_->remove(path)) { root.close(); return true; }
    }
  }
  root.close();
  return false;
}

void SoundStore::recoverSoundFiles() {
  if (!fs_) return;
  for (uint8_t pass = 0; pass < fscfg::RECOVER_MAX_PASSES && recoverSoundFilesOnce(); pass++) {}
}

bool SoundStore::ensureMounted() {
  if (backend_ != FsBackend::None && fs_) return true;

  // Probuj po kolei znane systemy plikow (bez formatowania).
  struct Candidate { fs::FS *fs; FsBackend backend; bool ok; };
  Candidate candidates[] = {
    { &SPIFFS,   FsBackend::Spiffs,   SPIFFS.begin(false) },
    { &LittleFS, FsBackend::LittleFs, false },
    { &FFat,     FsBackend::FFatFs,   false },
  };
  if (!candidates[0].ok) candidates[1].ok = LittleFS.begin(false);
  if (!candidates[0].ok && !candidates[1].ok) candidates[2].ok = FFat.begin(false);
  for (auto &c : candidates) {
    if (c.ok) {
      backend_ = c.backend; fs_ = c.fs;
      recoverSoundFiles();
      Serial.printf("System plikow: %s\n", name());
      return true;
    }
  }
  // Fabrycznie czysty flash: jednorazowy format SPIFFS, by panel WWW mogl wgrac MP3.
  if (!formatTried_) {
    formatTried_ = true;
    Serial.println("Brak FS - formatuje SPIFFS...");
    if (SPIFFS.begin(true)) {
      backend_ = FsBackend::Spiffs; fs_ = &SPIFFS;
      Serial.println("System plikow: SPIFFS (nowo sformatowany)");
      return true;
    }
  }
  backend_ = FsBackend::None; fs_ = nullptr;
  Serial.println("Brak systemu plikow z MP3");
  return false;
}

// ============================================================================
//  IMPLEMENTACJE — BatteryMonitor
// ============================================================================
bool BatteryMonitor::init() {
  if (ready_) return true;
  adc_oneshot_unit_init_cfg_t initCfg = {};
  initCfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&initCfg, &adc_) != ESP_OK) return false;

