Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
  adc_oneshot_chan_cfg_t chanCfg = {};
  chanCfg.bitwidth = ADC_BITWIDTH_12;
  chanCfg.atten = ADC_ATTEN_DB_12;
  if (adc_oneshot_config_channel(adc_, batcfg::ADC_CHANNEL, &chanCfg) != ESP_OK) {
    adc_oneshot_del_unit(adc_); adc_ = nullptr; return false;
  }
  adc_cali_curve_fitting_config_t caliCfg = {};
  caliCfg.unit_id = ADC_UNIT_1;
  caliCfg.atten = ADC_ATTEN_DB_12;
  caliCfg.bitwidth = ADC_BITWIDTH_12;
  caliReady_ = adc_cali_create_scheme_curve_fitting(&caliCfg, &cali_) == ESP_OK;
  ready_ = true;
  return true;
}

// Interpolacja liniowa po krzywej OCV->SoC (batcfg::OCV_CURVE).
uint8_t BatteryMonitor::percentFromVoltage(float v) {
  const auto &curve = batcfg::OCV_CURVE;
  if (v <= curve.front().voltage) return 0;
  if (v >= curve.back().voltage)  return 100;
  for (size_t i = 1; i < curve.size(); i++) {
    if (v < curve[i].voltage) {
      float frac = (v - curve[i-1].voltage) / (curve[i].voltage - curve[i-1].voltage);
      return (uint8_t)(curve[i-1].soc + frac * (curve[i].soc - curve[i-1].soc) + 0.5f);
    }
  }
  return 100;
}

// Histereza pelnego naladowania: >=99% pokazuj 100% i trzymaj, az spadnie <98%.
uint8_t BatteryMonitor::stabilizePercent(uint8_t measured) const {
  if (measured >= batcfg::FULL_FLOOR) return 100;
  if (g_persist.batteryHasReading && g_persist.batteryPercent == 100 &&
      measured >= batcfg::FULL_HOLD_FLOOR) return 100;
  return measured;
}

// Zwiezle podsumowanie zuzycia do NVS max raz/dobe (nadpisywane, malo flash).
void BatteryMonitor::maybeWriteDailySummary(time_t now) {
  struct tm t; localtime_r(&now, &t);
  int day = localDayKey(t);
  if (day == g_persist.lastSummaryDay) return;
  float perDay = g_persist.drain.mahPerDay();
  if (perDay < 0.0f) return;
  g_persist.lastSummaryDay = day;              // oznacz dzien NIM sprobujesz zapisu
  app_.settings().saveDrainSummary(g_persist.batteryPercent, perDay, day);
  Serial.printf("Zuzycie: %.1f mAh/dzien, ~%.0f dni\n",
                perDay, g_persist.drain.daysRemaining(g_persist.batteryPercent));
}

void BatteryMonitor::update(bool force) {
  if (!force && (int32_t)(millis() - nextReadMs_) < 0) return;

  // Pod obciazeniem (audio, dzwoniacy budzik, serwer web) napiecie zacisku siada
  // przez rezystancje wewnetrzna ogniwa -> pomiar zanizony. Odlozyc do bezczynnosci.
  if (!force && (app_.audioActive() || app_.web().isActive())) {
    nextReadMs_ = millis() + batcfg::BUSY_RETRY_MS; return;
  }

  nextReadMs_ = millis() + batcfg::READ_INTERVAL_MS;
  if (!init()) { nextReadMs_ = millis() + batcfg::BUSY_RETRY_MS; return; }

  uint32_t sum = 0; uint8_t samples = 0;
  for (uint8_t i = 0; i < batcfg::SAMPLE_COUNT; i++) {
    int raw = 0;
    if (adc_oneshot_read(adc_, batcfg::ADC_CHANNEL, &raw) == ESP_OK) { sum += (uint32_t)raw; samples++; }
  }
  if (samples == 0) { nextReadMs_ = millis() + batcfg::BUSY_RETRY_MS; return; }

  int raw = (int)((sum + samples / 2) / samples);
  int mv = 0;
  if (caliReady_) adc_cali_raw_to_voltage(cali_, raw, &mv);
  else mv = (raw * batcfg::ADC_FALLBACK_FULL_MV) / batcfg::ADC_MAX_RAW;   // bez kalibracji eFuse

  float measured = (mv * 0.001f) * batcfg::DIVIDER_RATIO * batcfg::VOLTAGE_CALIBRATION;
  if (!g_persist.batteryHasReading || force) { g_persist.batteryVoltage = measured; g_persist.batteryHasReading = true; }
  else g_persist.batteryVoltage = g_persist.batteryVoltage * batcfg::EMA_KEEP +
                                  measured * (1.0f - batcfg::EMA_KEEP);   // EMA

  uint8_t old = g_persist.batteryPercent;
  g_persist.batteryPercent = stabilizePercent(percentFromVoltage(g_persist.batteryVoltage));
  time_t nowT = time(nullptr);
  if (isSupportedEpoch(nowT)) {
    g_persist.drain.onSample((int64_t)nowT, g_persist.batteryPercent);
    maybeWriteDailySummary(nowT);
#if ENABLE_DIAGNOSTICS
    if (g_persist.coldBootEpoch == 0) g_persist.coldBootEpoch = (int64_t)nowT;
#endif
  }
  if (force || old != g_persist.batteryPercent) app_.markDirty();
}

#if ENABLE_LOW_BATTERY_PROTECT
bool BatteryMonitor::isLow() const {
  return g_persist.batteryHasReading && g_persist.batteryPercent <= batcfg::LOW_PERCENT;
}
// update() bramkuje pomiar pod obciazeniem, wiec batteryVoltage ~ OCV.
bool BatteryMonitor::isCritical() const {
  return g_persist.batteryHasReading &&
         (g_persist.batteryVoltage <= batcfg::CRITICAL_VOLTAGE ||
          g_persist.batteryPercent <= batcfg::CRITICAL_PERCENT);
}
#endif

// ============================================================================
//  IMPLEMENTACJE — AudioPlayer (ES8311 + MP3 przez I2S, petla dzwonienia)
// ============================================================================
void AudioPlayer::ensurePins() {
  if (pinsReady_) return;
  Audio::audio_info_callback = audioLogCallback;
  decoder_.setPinout(pins::I2S_BCLK, pins::I2S_WS, pins::I2S_DOUT, pins::I2S_MCLK);
  decoder_.setOutput48KHz(true);
  decoder_.setVolume(alarmcfg::DEFAULT_VOLUME);
  pinsReady_ = true;
}

bool AudioPlayer::ensureCodec() {
  if (ready_) return true;
  setCpuFrequencyMhz(powercfg::AUDIO_CPU_MHZ);  // dekoder MP3 potrzebuje zapasu ponad dzienne 80 MHz
  amplifierOff();   // PA wlacza dopiero startSound() PO konfiguracji kodeka (bez trzasku)
  ensurePins();
  ready_ = codec_.begin(pins::I2C_SDA, pins::I2C_SCL, i2cbus::FREQ_HZ);
  if (ready_) { codec_.setVolume(alarmcfg::CODEC_VOLUME_PERCENT); codec_.configBits16(); }
  else {
    Serial.println("ES8311 init failed");
    digitalWrite(pins::PA_ENABLE, LOW);
    setCpuFrequencyMhz(powercfg::DAY_CPU_MHZ);  // audio nie ruszy -> nie trzymaj podbitego CPU
  }
  return ready_;
}

void AudioPlayer::codecPowerDown() { codec_.powerDown(); }

// Uspij kodek po odtwarzaniu — ES8311 jest na stalej szynie 3V3, wiec to najwiekszy
// odbiornik w spoczynku. startSound() go wskrzesza. Zdejmuje tez podbicie CPU
// (nocne sciezki i tak ustawiaja PRE_SLEEP_CPU_MHZ PO tym wywolaniu).
void AudioPlayer::shutdownCodec() {
  if (!ready_) { digitalWrite(pins::PA_ENABLE, LOW); return; }
  decoder_.stopSong();
  codec_.powerDown();
  digitalWrite(pins::PA_ENABLE, LOW);
  ready_ = false;
  setCpuFrequencyMhz(powercfg::DAY_CPU_MHZ);
}

bool AudioPlayer::startSound(uint8_t soundIndex, uint8_t volume) {
  stopPlayback(StopCause::Auto);
  if (soundIndex >= alarmcfg::SOUND_COUNT) soundIndex = 0;

  // Wspolne zakonczenie bledu: kodek spac, status na ekran, repaint.
  auto fail = [&](const String &status, bool codecUp) {
    if (codecUp) shutdownCodec();
    app_.setStatus(status);
    app_.markDirty();
    return false;
  };

