Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    if (!alarms_[i].enabled) continue;
    int occurrenceDay;
    time_t dueEpoch;
    if (alarmDueNow(t, now, alarms_[i].hour, alarms_[i].minute, alarms_[i].second,
                    lateWindowSec, &occurrenceDay, &dueEpoch) &&
        g_persist.lastTriggerDay[i] != occurrenceDay) {
      g_persist.lastTriggerDay[i] = occurrenceDay;
      // Skonsumuj budziki wymagalne w TEJ SAMEJ CHWILI (kolizja godzin w noc
      // zmiany czasu: 02:30 i 03:30 = ten sam epoch) -> jedno dzwonienie.
      // Porownujemy dokladne epoki wystapien, NIE "due w oknie" — szerokie okno
      // (90 s po korekcie NTP) pozeraloby budziki o roznych terminach (fix v8.0).
      for (int j = 0; j < alarmcfg::ALARM_COUNT; j++) {
        int otherDay;
        time_t otherEpoch;
        if (j != i && alarms_[j].enabled &&
            alarmDueNow(t, now, alarms_[j].hour, alarms_[j].minute, alarms_[j].second,
                        lateWindowSec, &otherDay, &otherEpoch) &&
            otherEpoch == dueEpoch)
          g_persist.lastTriggerDay[j] = otherDay;
      }
      app_.audio().startRinging(i);
      return;
    }
  }
}

bool AlarmScheduler::anyDueNow(const struct tm &t) const {
  time_t now = time(nullptr);
  for (const AlarmConfig &a : alarms_)
    if (a.enabled &&
        alarmDueNow(t, now, a.hour, a.minute, a.second, alarmcfg::LATE_WINDOW_SEC, nullptr, nullptr))
      return true;
  return false;
}

time_t AlarmScheduler::nextEpoch(const struct tm &base, time_t now) const {
  time_t best = 0;
  for (const AlarmConfig &a : alarms_) {
    if (!a.enabled) continue;
    time_t cand = nextOccurrence(base, a.hour, a.minute, a.second, now);
    if (best == 0 || cand < best) best = cand;
  }
  return best;
}

// ============================================================================
//  IMPLEMENTACJE — NetworkTimeService (WiFi + NTP)
//  Czas z RTC pierwszy; NTP NADPISUJE tylko po REALNYM pakiecie (gate atomic).
//  WiFi wlaczone tylko na czas proby.
// ============================================================================
// Jedna semantyka bezpiecznej kopii do bufora (obciecie + terminator).
void NetworkTimeService::copyBounded(char *dst, size_t dstSize, const char *src) {
  strncpy(dst, src ? src : "", dstSize - 1);
  dst[dstSize - 1] = '\0';
}
void NetworkTimeService::setCreds(const char *s, const char *p) {
  copyBounded(ssid_, sizeof(ssid_), s);
  copyBounded(pass_, sizeof(pass_), p);
}
void NetworkTimeService::setSsid(const String &s) { copyBounded(ssid_, sizeof(ssid_), s.c_str()); }
void NetworkTimeService::setPass(const String &p) { copyBounded(pass_, sizeof(pass_), p.c_str()); }

long NetworkTimeService::secsSinceLastSync() const {
  if (g_persist.lastNtpSyncEpoch <= 0) return -1;
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return -1;
  long d = (long)(now - (time_t)g_persist.lastNtpSyncEpoch);
  return d < 0 ? 0 : d;
}

void NetworkTimeService::stopSntpCallbacks() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  if (esp_sntp_enabled()) esp_sntp_stop();
  sntp_set_time_sync_notification_cb(nullptr);
}

// Rollback po nieudanym NTP: przywroc czas sprzed proby — TYLKO gdy pakiet
// faktycznie zmodyfikowal zegar (g_ntpGotPacket). Nieudana proba bez pakietu
// (timeout, zerwane WiFi) nie ruszyla czasu systemowego, a bezwarunkowy rollback
// cofalby zegar o czas trwania proby, do ~50 s na kazde niepowodzenie (fix v8.0).
void NetworkTimeService::restoreTimeAfterFailedNtp() {
  if (!g_ntpGotPacket.load(std::memory_order_acquire)) return;
  if (isSupportedEpoch(fallbackTime_.tv_sec)) settimeofday(&fallbackTime_, nullptr);
  else setSystemEpoch(0);
}

void NetworkTimeService::stopWifiAndNtp() {
  bool wasAttempting = state_ != NtpState::Idle;
  if (state_ == NtpState::WaitingForPacket) restoreTimeAfterFailedNtp();
  stopSntpCallbacks();
  state_ = NtpState::Idle;
  manualAttempt_ = false;
  wifiHintActive_ = false;
  wifiLostMs_ = 0;
  g_ntpGotPacket.store(false, std::memory_order_release);
  // Przerwano probe, brak waznego czasu i brak zaplanowanego ponowienia -> zaplanuj
  // jedno (backoff), by zegar w koncu zdobyl czas mimo przerwania (np. zamkniecie WWW).
  if (wasAttempting && retriesLeft_ == 0 && !isSupportedEpoch(time(nullptr))) {
    retriesLeft_ = 1;
    nextRetryMs_ = millis() + backoffMs_;
  }
  wifiPowerOff();
}

bool NetworkTimeService::wifiBeginSmart() {
  WiFi.persistent(false);
#if FAST_NTP_RECONNECT
  if (g_persist.wifiHint) {
    WiFi.begin(ssid_, pass_, g_persist.wifiChannel, g_persist.wifiBssid);
    return true;
  }
#endif
  WiFi.begin(ssid_, pass_);
  return false;
}

void NetworkTimeService::wifiRetryFullScan() {
#if FAST_NTP_RECONNECT
  g_persist.wifiHint = false;
#endif
  WiFi.disconnect(false, false);
  WiFi.begin(ssid_, pass_);
}

void NetworkTimeService::wifiCacheHint() {
#if FAST_NTP_RECONNECT
  if (WiFi.status() == WL_CONNECTED) {
    g_persist.wifiChannel = WiFi.channel();
    const uint8_t *b = WiFi.BSSID();
    if (b) { for (int i = 0; i < 6; i++) g_persist.wifiBssid[i] = b[i]; g_persist.wifiHint = true; }
  }
#endif
}

// Blokujace laczenie WiFi (tylko sciezka panelu WWW; NTP laczy sie nieblokujaco).
bool NetworkTimeService::ensureWifi(uint32_t timeoutMs) {
  if (strlen(ssid_) == 0) return false;
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);                 // modem-sleep -> mniejszy prad STA
  if (WiFi.status() != WL_CONNECTED) {
    bool usedHint = wifiBeginSmart();
    bool retriedFullScan = false;
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
      if (usedHint && !retriedFullScan && millis() - start >= ntpcfg::WIFI_HINT_FALLBACK_MS) {
        retriedFullScan = true; wifiRetryFullScan();
      }
      delay(100); yield();
      watchdogFeed();                  // blokuje do ~15 s — nie pozwol na falszywy reset
    }
  }
  bool ok = WiFi.status() == WL_CONNECTED;
  if (ok) wifiCacheHint(); else g_persist.wifiHint = false;
  return ok;
}

void NetworkTimeService::scheduleRtcWriteRetry(uint8_t retries) {
  rtcWriteRetriesLeft_ = retries;
  rtcWriteNextRetryMs_ = millis() + rtccfg::WRITE_RETRY_MS;
}

void NetworkTimeService::handleRtcWriteRetry() {
  if (rtcWriteRetriesLeft_ == 0 || (int32_t)(millis() - rtcWriteNextRetryMs_) < 0) return;
  if (app_.rtc().writeTime(time(nullptr), app_.audioActive())) {
    rtcWriteRetriesLeft_ = 0;
    app_.setNtpStatus("NTP OK, RTC OK");
  } else if (--rtcWriteRetriesLeft_ > 0) {
    rtcWriteNextRetryMs_ = millis() + rtccfg::WRITE_RETRY_MS;
    app_.setNtpStatus("NTP OK, RTC retry");
  } else {
    app_.setNtpStatus("NTP OK, RTC ERR");
  }
  app_.markDirty();
}

