Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
bool NetworkTimeService::handleNtpRetry() {
  if (state_ != NtpState::Idle) return true;
  if (retriesLeft_ == 0) return false;
  if ((int32_t)(millis() - nextRetryMs_) < 0) return true;
  --retriesLeft_;
  syncNow(SyncTrigger::Scheduled);
  return true;
}

#if ENABLE_RTC_AUTOTRIM
// Autokalibracja offsetu: po kazdym pakiecie NTP zmierz dryft fazowo i — gdy
// okno NTP->NTP jest wiarygodne — przesun rejestr 0x02 tak, by wyzerowac ppm.
// Nowy offset trafia do NVS (przezywa utrate zasilania) i dziala od razu.
// Kwantyzacja 4.34 ppm/LSB zostawia dryf resztkowy do ~0.19 s/dobe.
void NetworkTimeService::maybeAutotrimRtc(time_t syncedEpoch) {
  if (app_.audioActive()) return;                 // pomiar blokuje ~1.3 s -> nie przy audio
  if (!g_persist.rtcPhaseAligned) return;         // faza startu okna nieznana -> ppm bez sensu
  if (g_persist.lastNtpSyncEpoch <= 0) return;
  int64_t windowSec = (int64_t)syncedEpoch - g_persist.lastNtpSyncEpoch;
  if (windowSec < rtccfg::AUTOTRIM_MIN_WINDOW_SEC || windowSec > rtccfg::AUTOTRIM_MAX_WINDOW_SEC) return;

  int64_t driftUs;
  if (!app_.rtc().measureDriftUs(&driftUs)) return;
  float ppm = (float)driftUs / (float)windowSec;  // us/s = ppm
  g_persist.lastDriftPpm = ppm;
  g_persist.lastDriftWindowSec = (int32_t)windowSec;
  if (fabsf(ppm) > rtccfg::AUTOTRIM_MAX_PLAUSIBLE_PPM) return;   // krysztal tak nie plywa -> zly pomiar

  int target = suggestedTotalOffsetLsb(ppm * rtccfg::PPM_SEC_PER_DAY, app_.rtc().offsetLsb());
  if (target == (int)app_.rtc().offsetLsb()) return;             // korekta ponizej 1 LSB
  if (app_.rtc().applyOffsetLsb((int8_t)target)) {
    g_persist.autotrimAdjustCount++;
    app_.settings().saveRtcOffset((int8_t)target);
    Serial.printf("RTC autotrim: %.2f ppm w %lld s -> offset LSB %d\n",
                  ppm, (long long)windowSec, target);
  }
}
#endif

void NetworkTimeService::checkSchedule() {
#if ENABLE_LOW_BATTERY_PROTECT
  // ECO: gdy mamy poprawny czas, NIE budz WiFi do auto-sync (najwiekszy pobor).
  // Pusty RTC -> pozwol sie synchronizowac mimo niskiej baterii (zegar musi miec czas).
  if (app_.battery().isLow() && isSupportedEpoch(time(nullptr))) return;
#endif
  if (handleNtpRetry()) return;
  struct tm t;
  if (!getLocalTm(&t)) return;
  int day = localDayKey(t);
  // Preferowane okno 18:00-18:05; pominiete -> dogon do poczatku nocy. ntpStartedDay
  // gwarantuje DOKLADNIE jeden sync/dobe.
  bool preferredWindow = (t.tm_hour == ntpcfg::DAILY_SYNC_HOUR && t.tm_min <= ntpcfg::SYNC_MINUTE_WINDOW);
  bool catchupWindow   = (t.tm_hour >= ntpcfg::DAILY_SYNC_HOUR && t.tm_hour < powercfg::NIGHT_START_HOUR);
  if ((preferredWindow || catchupWindow) && g_persist.ntpStartedDay != day) {
    g_persist.ntpStartedDay = day;
    retriesLeft_ = 2;
    syncNow(SyncTrigger::Scheduled);
    return;
  }
  // Poranne NTP 06:00-06:05 (wlasny znacznik ntpMorningDay — NIE konsumuje
  // straznika okna wieczornego). W v7.1 to okno zylo tylko w setup(): urzadzenie
  // czuwajace przez 06:00 (dzwoniacy budzik, otwarte WWW) gubilo poranny sync na
  // caly dzien (fix v8.0). Po wybudzeniu z nocy pierwszy obieg loop() trafia tu
  // natychmiast, wiec timing wzgledem v7.1 bez zmian.
  if (t.tm_hour == powercfg::NIGHT_END_HOUR && t.tm_min < ntpcfg::SYNC_MINUTE_WINDOW &&
      g_persist.ntpMorningDay != day) {
    g_persist.ntpMorningDay = day;
    retriesLeft_ = 2;
    syncNow(SyncTrigger::Scheduled);
  }
}

// ============================================================================
//  IMPLEMENTACJE — DisplayUi (U8g2, panel ST7305)
// ============================================================================
// Ten egzemplarz ST7305 NIE przywraca obrazu po deep-sleep przez sam initInterface()
// -> pelny re-init (reset RST + begin) przy KAZDYM wejsciu w setup (zimny start
// ORAZ po deep-sleep). W dzien petla uzywa light-sleep (setup() sie nie powtarza)
// -> panel trzyma obraz -> brak mrugania.
//
// v10: po begin() przelaczamy panel w LPM (Low Power Mode, cmd 0x39) — odswiezanie
// wewnetrzne 1 Hz zamiast 32 Hz w HPM (cmd 0x38, ktory U8g2 wysyla w init). Zegar
// odswieza sie raz na minute, wiec 1 Hz w zupelnosci wystarcza, a panel przestaje
// taktowac swoja matryce z 32 Hz 24/7 (oszczednosc ~0,25-0,45 mA sredniego poboru).
// Jedno wyslanie wystarcza: deep-sleep robi pelny re-init w setup(), a light-sleep
// nie resetuje panelu. NIE uzywac setPowerSave(1) — to cmd 0x28, ktore GASI obraz.
// UWAGA: przy 1 Hz mozliwy ghosting — zweryfikowac na sprzecie; w razie problemow
// wrocic do 0x38 (HPM) lub podbic odswiezanie.
void DisplayUi::setup() {
  constexpr uint32_t RESET_PULSE_MS = 10;
  pinMode(pins::LCD_RST, OUTPUT);
  digitalWrite(pins::LCD_RST, HIGH);
  digitalWrite(pins::LCD_RST, LOW);
  delay(RESET_PULSE_MS);
  digitalWrite(pins::LCD_RST, HIGH);
  delay(RESET_PULSE_MS);
  // HW SPI: usuwa ~4 s opoznienia pelnego sendBuffer().
  SPI.begin(pins::LCD_SCK, -1, pins::LCD_MOSI, pins::LCD_CS);
  panel_.setBusClock(lcd::SPI_BUS_HZ);
  panel_.begin();
  panel_.sendF("c", 0x39);   // LPM: odswiezanie 1 Hz zamiast 32 Hz (HPM)
  delay(100);                // datasheet 7.11: odczekac ~1 ramke po przelaczeniu
  panel_.setContrast(lcd::CONTRAST);
}

void DisplayUi::drawPhotoGlyph(int x, int y, int glyph, bool colon) {
  uint16_t p = colon ? PHOTO_COLON_OFFSET : pgm_read_word(&PHOTO_DIGIT_OFFSET[glyph]);
  for (int row = 0; row < PHOTO_DIGIT_H; row++) {
    uint8_t segs = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
    for (uint8_t i = 0; i < segs; i++) {
      uint8_t start = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      uint8_t width = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      panel_.drawHLine(x + start, y + row, width);
    }
  }
  // Font (Impact) ma skrocona dolna stopke cyfry 4 — uzupelniamy ja tutaj.
  // Wspolrzedne sprzezone z PHOTO_DIGIT_W/H; zmiana fontu = rewizja tych prostokatow.
  if (!colon && glyph == 4) {
    constexpr int DIGIT4_PATCH1_X = 39, DIGIT4_PATCH1_Y = 112, DIGIT4_PATCH1_W = 41, DIGIT4_PATCH1_H = 13;
    constexpr int DIGIT4_PATCH2_X = 40, DIGIT4_PATCH2_Y = 125, DIGIT4_PATCH2_W = 31, DIGIT4_PATCH2_H = 25;
    panel_.drawBox(x + DIGIT4_PATCH1_X, y + DIGIT4_PATCH1_Y, DIGIT4_PATCH1_W, DIGIT4_PATCH1_H);
    panel_.drawBox(x + DIGIT4_PATCH2_X, y + DIGIT4_PATCH2_Y, DIGIT4_PATCH2_W, DIGIT4_PATCH2_H);
  }
}

void DisplayUi::drawLargeTime(uint8_t hour, uint8_t minute, int y) {
  int totalW = PHOTO_DIGIT_W * 4 + PHOTO_COLON_W + PHOTO_DIGIT_GAP * 4;
  int x = (lcd::WIDTH - totalW) / 2 + PHOTO_TIME_X_SHIFT;
  drawPhotoGlyph(x, y, hour / 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, hour % 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x + PHOTO_COLON_X_SHIFT, y + PHOTO_COLON_Y_SHIFT, 0, true);
  x += PHOTO_COLON_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute / 10, false); x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute % 10, false);
}

void DisplayUi::drawBellIcon(int x, int y, bool active) {
  panel_.setDrawColor(1);
  panel_.drawDisc(x + 12, y + 10, 8);
  panel_.drawBox(x + 5, y + 10, 15, 11);
  panel_.drawBox(x + 3, y + 20, 19, 4);
  panel_.drawDisc(x + 12, y + 25, 3);
  panel_.drawBox(x + 9, y + 3, 7, 4);
  if (!active) {                                   // przekreslenie: budziki wylaczone
    panel_.drawLine(x + 1, y + 26, x + 25, y + 2);
    panel_.drawLine(x + 2, y + 26, x + 26, y + 2);
  }
}

void DisplayUi::drawBatteryIcon(int x, int y, uint8_t percent) {
  if (percent > 100) percent = 100;
  panel_.drawFrame(x, y, 28, 13);                  // korpus 28x13 + nosek
  panel_.drawBox(x + 28, y + 4, 3, 5);
  int fill = map(percent, 0, 100, 0, 24);
  if (fill > 0) panel_.drawBox(x + 2, y + 2, fill, 9);
  char txt[8];
  snprintf(txt, sizeof(txt), "%u%%", percent);
  panel_.setFont(u8g2_font_7x14_tf);
  panel_.drawStr(x - 42, y + 12, txt);             // etykieta % na lewo od ikony
}

void DisplayUi::drawCentered(const char *text, int y) {
  int w = panel_.getStrWidth(text);
  int x = (lcd::WIDTH - w) / 2;
  if (x < 0) x = 0;
  panel_.drawStr(x, y, text);
}

