Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v10.0.ino
// Reczne wylaczenie panelu WWW: odsyla potwierdzenie, a samo zamkniecie wykonuje
// petla PO wyslaniu odpowiedzi (ustawiamy termin okna na "teraz").
void WebPanel::handleWebOff() {
  String html; pageHeader(html);
  html += F("<section><b>Panel WWW wylaczony.</b>"
            "<p class='muted'>WiFi zostalo wylaczone dla oszczednosci baterii. "
            "Aby wlaczyc panel ponownie: przytrzymaj przycisk KEY na zegarze.</p>"
            "</section></main></body></html>");
  server_.send(200, "text/html", html);
  untilMs_ = millis();   // petla wykryje uplyw okna i zamknie panel po flushu strony
}

void WebPanel::installRoutes() {
  server_.on("/", HTTP_GET, [this]{ handleRoot(); });
  server_.on("/save", HTTP_POST, [this]{ handleSave(); });
  server_.on("/sync", HTTP_GET, [this]{ handleSync(); });
  server_.on("/stop", HTTP_GET, [this]{ handleStop(); });
  server_.on("/test", HTTP_POST, [this]{ handleTest(); });
  server_.on("/mp3upload", HTTP_POST, [this]{ handleMp3UploadDone(); }, [this]{ handleMp3UploadStream(); });
  server_.on("/mp3delete", HTTP_POST, [this]{ handleMp3Delete(); });
  server_.on("/off", HTTP_GET, [this]{ handleWebOff(); });
#if ENABLE_DIAGNOSTICS
  server_.on("/info", HTTP_GET, [this]{ handleInfo(); });
#endif
}

bool WebPanel::startWebWindow() {
  if (active_) {
    if (WiFi.status() == WL_CONNECTED) { extendWindow(); app_.markDirty(); return true; }
    server_.stop(); active_ = false;   // okno "aktywne" bez WiFi -> restart od zera
  }
  if (!app_.ntp().ensureWifi(ntpcfg::WIFI_TIMEOUT_MS)) {
    app_.setStatus("brak polaczenia WiFi");
    app_.ntp().stopWifiAndNtp();
    app_.markDirty();
    return false;
  }
  if (!routesInstalled_) { installRoutes(); routesInstalled_ = true; }
  server_.begin();
  active_ = true;
  extendWindow();
  app_.markDirty();
  Serial.print("WWW IP: "); Serial.println(WiFi.localIP());
  return true;
}

void WebPanel::stopWindow() {
  server_.stop();
  active_ = false;
  // Aktywna proba NTP (do ~50 s) sama dokonczy walidacje i wylaczy WiFi.
  if (!app_.ntp().isBusy()) app_.ntp().stopWifiAndNtp();
  app_.markDirty();
}

void WebPanel::forceStop() {
  server_.stop();
  active_ = false;
}

void WebPanel::service() {
  if (WiFi.status() != WL_CONNECTED) {
    // Chwilowy zanik (roaming) nie zamyka okna od razu: auto-reconnect zwykle wraca.
    if (wifiLostMs_ == 0) wifiLostMs_ = millis();
    if (millis() - wifiLostMs_ > webcfg::WIFI_GRACE_MS) {
      wifiLostMs_ = 0;
      app_.setStatus("WiFi rozlaczone");
      stopWindow();
    }
  } else {
    wifiLostMs_ = 0;
    server_.handleClient();
    if ((int32_t)(millis() - untilMs_) >= 0) stopWindow();
  }
}

// ============================================================================
//  IMPLEMENTACJE — PowerPlanner (tryb nocny / light-sleep / sen ochronny)
// ============================================================================
void PowerPlanner::releaseNightHolds() {
  gpio_deep_sleep_hold_dis();
  for (gpio_num_t pin : pins::DEEP_SLEEP_HOLD) gpio_hold_dis(pin);
  gpio_hold_dis(pins::PA_ENABLE);
  rtc_gpio_deinit(pins::KEY);
  rtc_gpio_deinit(pins::PREVIEW);
  rtc_gpio_deinit(pins::RTC_INT);
}

// Zatrzasnij piny panelu i wzmacniacza w bezpiecznym stanie na czas deep-sleep
// (bez holdu piny plywaja i panel dostaje smieci / PA strzela).
void PowerPlanner::holdNightPins() {
  pinMode(pins::LCD_RST, OUTPUT);  digitalWrite(pins::LCD_RST, HIGH);
  pinMode(pins::LCD_CS, OUTPUT);   digitalWrite(pins::LCD_CS, HIGH);
  pinMode(pins::LCD_DC, OUTPUT);   digitalWrite(pins::LCD_DC, HIGH);
  pinMode(pins::LCD_SCK, OUTPUT);  digitalWrite(pins::LCD_SCK, LOW);
  pinMode(pins::LCD_MOSI, OUTPUT); digitalWrite(pins::LCD_MOSI, LOW);
  pinMode(pins::PA_ENABLE, OUTPUT); digitalWrite(pins::PA_ENABLE, LOW);
  for (gpio_num_t pin : pins::DEEP_SLEEP_HOLD) gpio_hold_en(pin);
  gpio_hold_en(pins::PA_ENABLE);
  gpio_deep_sleep_hold_en();
}

void PowerPlanner::shutdownNightPeripherals() {
  if (app_.web().isActive()) app_.web().forceStop();
  app_.ntp().stopWifiAndNtp();
  app_.audio().stopPlayback(StopCause::User);
  app_.audio().shutdownCodec();
  amplifierOff();
}

// Wspolne zejscie do deep-sleep (noc + ochrona ogniwa). Wolajacy narysowal juz
// swoja strone i policzyl maske EXT1. Kolejnosc 1:1 z v7.x: flush ekranu ->
// peryferia off -> CPU w dol -> zrodla wybudzen + pull-upy -> hold pinow -> sen.
void PowerPlanner::beginDeepSleep(uint64_t sleepUs, uint64_t ext1Mask) {
  delay(powercfg::DISPLAY_FLUSH_MS);        // panel konczy odswiezanie ostatniej strony
  shutdownNightPeripherals();
  setCpuFrequencyMhz(powercfg::PRE_SLEEP_CPU_MHZ);
  esp_sleep_enable_timer_wakeup(sleepUs);
  esp_sleep_enable_ext1_wakeup(ext1Mask, ESP_EXT1_WAKEUP_ANY_LOW);
  for (gpio_num_t pin : { pins::KEY, pins::PREVIEW, pins::RTC_INT }) {
    if (ext1Mask & (1ULL << pin)) {
      rtc_gpio_pullup_en(pin);
      rtc_gpio_pulldown_dis(pin);
    }
  }
  watchdogFeed();
  holdNightPins();
  Serial.flush();
  esp_deep_sleep_start();
}

time_t PowerPlanner::nightEndEpoch(time_t now) {
  if (!isSupportedEpoch(now)) return 0;
  struct tm t; localtime_r(&now, &t);
  return nextOccurrence(t, powercfg::NIGHT_END_HOUR, powercfg::NIGHT_END_MIN, 0, now);
}

#if ENABLE_LOW_BATTERY_PROTECT
// Ochronny deep-sleep przy krytycznym ogniwie: chroni Li-ion przed glebokim
// rozladowaniem i brownoutem. Budzi sie cyklicznie (timer) sprawdzic ladowanie;
// KEY pozwala wybudzic recznie. Deep-sleep resetuje chip -> setup() ponownie
// zmierzy ogniwo i wznowi prace lub usnie dalej.
void PowerPlanner::enterCriticalBatterySleepIfNeeded() {
  if (!app_.battery().isCritical()) return;
  if (app_.busy()) return;   // dzwoni budzik / audio / WWW / podglad / aktywny NTP / zapis RTC

  Serial.printf("Akumulator krytyczny (%u%%, %.2f V) -> ochronny sen %lu s\n",
                app_.battery().percent(), app_.battery().voltage(),
                (unsigned long)batcfg::CRITICAL_RECHECK_SEC);
  app_.displayUi().drawCriticalBatteryPage();
  beginDeepSleep((uint64_t)batcfg::CRITICAL_RECHECK_SEC * 1000000ULL, 1ULL << pins::KEY);
}
#endif

// Tryb nocny: deep-sleep do 06:00 / najblizszego budzika. Ekran zgaszony. Budzenie:
// alarm RTC (dokladny) + timer ESP (zabezpieczenie) + przyciski EXT1.
void PowerPlanner::enterNightSleepIfNeeded(bool force) {
  struct tm t;
  if (!getLocalTm(&t) || !isNightMode(t)) return;
  if (app_.alarms().anyDueNow(t)) return;
  if (!force && (app_.busy() || app_.buttons().wakeHeld())) return;   // utrzymaj wybudzenie po nacisnieciu

  time_t now = time(nullptr);
  time_t wakeAt = nightEndEpoch(now);
  time_t alarmAt = app_.alarms().nextEpoch(t, now);
  if (alarmAt > now && alarmAt < wakeAt) wakeAt = alarmAt;
  if (wakeAt <= now) wakeAt = now + (time_t)powercfg::NIGHT_EMERGENCY_SLEEP_SEC;
  uint64_t sleepSec = (uint64_t)(wakeAt - now);
  if (sleepSec < powercfg::NIGHT_MIN_SLEEP_SEC) {
    sleepSec = powercfg::NIGHT_MIN_SLEEP_SEC;
    wakeAt = now + (time_t)sleepSec;
  }

